Repository: omeka/omeka-s-enduser
Catalog: locales/*/LC_MESSAGES/docs/modules/collecting.po
Languages: fr

source: The Collecting module allows you to gather public contributions through your sites.
fr: Le module Collecting vous permet de rassembler des contributions du public via vos sites.

source: Once activated on the [modules](index.md) tab of the admin dashboard, Collecting is configured on a site-by-site basis.
fr: Une fois activé dans l'onglet [modules](index.md) du tableau de bord d'administration, Collecting se configure site par site.

source: Site settings
fr: Paramètres du site

source: Collecting adds a section to your [site settings](../sites/site_settings.md) where you can manage terms of service and email for the collecting forms for this site.
fr: Collecting ajoute une section à vos [paramètres de site](../sites/site_settings.md) où vous pouvez gérer les conditions d'utilisation et l'e-mail pour les formulaires de collecte pour ce site.

source: ![The Collecting section in site settings with two fields as described below.](modulesfiles/collecting_settingsSite.png)
fr: ![La section Collectes des paramètres du site avec deux champs comme décrits ci-dessous.](modulesfiles/collecting_settingsSite.png)

source: In this section are two fields:
fr: Dans cette section il y a deux champs:

source: **Terms of service** is a multi-line field where you can enter terms of services for material collected through this site. This text is linked from the form just above the submit button:
fr: **Conditions d'utilisation** est un champ multi-ligne où vous pouvez saisir les conditions d'utilisation pour le contenu collecté via ce site. Ce texte est lié au formulaire juste au dessus du bouton de soumission:

source: ![from the collecting form, the words "I accept the Terms of Service" over a button that says submit. The phrase Terms of Service are a link.](modulesfiles/collecting-ToSlink.png)
fr: ![dans le formulaire de collecte, les mots « J'accepte les conditions d'utilisation » au dessus d'un bouton soumettre. Les mots conditions d'utilisation sont un lien.](modulesfiles/collecting-ToSlink.png)

source: Clicking on the phrase "Terms of Service" will open a new window so that people filling out the form do not lose the information they have entered.
fr: Cliquer sur les mots « conditions d'utilisation » ouvrira une nouvelle fenêtre pour que les personnes remplissant le formulaire ne perdent pas les informations saisies.

source: **Email address** allows you to set a custom address from which submission emails will be sent. If left blank, these emails will be sent from the administrator email address in the [Global Settings](../admin/settings.md) for the Omeka S installation.
fr: **Adresse e-mail** vous permet de définir une adresse personnalisée à partir de laquelle les e-mails de soumission seront envoyés. Si laissé vide, ces e-mails seront envoyés de l'adresse e-mail de l'administrateur dans les [paramètres globaux](../admin/settings.md) de l'installation Omeka S.

source: Managing Collecting Forms
fr: Gestion des formulaires de collecte

source: If Collecting is active, then a tab for Collecting will appear in the context menu for every site. ![Red arrow points to the Collecting tab of the site National Parks](modulesfiles/collecting_nav.png)
fr: Si Collecting est actif, alors un onglet pour les collectes apparaîtra dans le menu contextuel de chaque site. ![Une flèche rouge pointe vers l'onglet Collectes du site de National Parks](modulesfiles/collecting_nav.png)

source: Clicking on this will take you to a list of your collecting forms for that site. If you have just installed the module, the Collecting Forms page will display the message "This site has no collecting forms." To add a new form, click the *Add new form* in the upper right hand corner of the window.
fr: Cliquer dessus vous emmènera vers la liste de vos formulaires de collecte pour ce site. Si vous venez d'installer le module, la page Formulaires de collecte affichera le message « Ce site n'a pas de formulaire de collecte ». Pour ajouter un nouveau formulaire, cliquez sur le bouton *Ajouter un nouveau formulaire* dans le coin supérieur droit de la fenêtre.

source: ![Collecting tab, no forms, red arrow points to the Add New button](modulesfiles/collecting_addnew.png)
fr: ![Onglet collecte, aucun formulaire, une flèche rouge pointe vers le bouton Ajouter Nouveau](modulesfiles/collecting_addnew.png)

source: Add New Form
fr: Ajouter un nouveau formulaire

source: The Add Collecting Form page has two sections: the first has a set of fields and options for you to complete; the second is where you add and edit the prompts which will make up the form that site visitors see and fill out.
fr: La page Ajouter un formulaire de collecte a deux sections: la première a un ensemble de champs et d'options à compléter; la deuxième est l'endroit où vous ajouter et modifier les invites qui composeront le formulaire que les visiteurs verront et rempliront.

source: ![Add Collecting Form page](modulesfiles/collecting_addform.png)
fr: ![Page Ajouter un formulaire de collecte](modulesfiles/collecting_addform.png)

source: Fields and Settings
fr: Champs et paramètres

source: *Label:* name the collecting form. The label will appear as a header above the form on the public side, so the label should be descriptive and helpful to both you and site visitors.
fr: *Libellé:* le nom du formulaire de collecte. Le libellé apparaîtra en en-tête au-dessus du formulaire sur la partie publique, donc le libellé doit être descriptif et utile à vous et vos visiteurs.

source: *Item Set:* select the item set to which you want to add collected items.
fr: *Collection:* sélectionnez la collection à laquelle ajouter les contenus collectés.

source: *Anonymity Type:* a dropdown with three options:
fr: *Type d'anonymat:* une liste déroulante avec trois options:

source: "User sets own anonymity": users can decide whether they contribute anonymously and whether their items can be published).
fr: « L'utilisateur définit son propre anonymat »: les utilisateurs peuvent décider de contribuer anonymement ou non et si leur contenu peut être publié ou non.

source: "User Public and User Name inputs are publicly visible": both the user's name and their items will be made public
fr: « Les valeurs Utilisateur public et Nom d’utilisateur sont visibles publiquement »: le nom d'utilisateur et les contenus seront rendus publics

source: "User Public and User Name inputs are private": both inputs remain public.
fr: « Les valeurs Utilisateur public et Nom d’utilisateur sont privées: les deux entrées restent privées.

source: *Success Text*: the message that displays on a new page if the item is successfully collected.
fr: *Texte de succès*: le message qui s'affiche sur une nouvelle page si le contenu a bien été collecté.

source: *Email text*: the message in the email that will be sent to site visitors who submit an item, if you collect an email address from them.
fr: *Texte e-mail*: le message de l'e-mail qui sera envoyé au visiteurs du site qui soumettent un contenu, si vous collectez leur adresse e-mail.

source: Prompts
fr: Champs

source: Prompts are listed in a table which gives their *Type* and the display *Text* on the public form. These prompts make up the form which site visitors will see (in addition to the label, discussed above).
fr: Les champs sont listés dans un tableau qui donne leur *Type* et le *Texte* affiché sur le formulaire public. Ces champs constituent le formulaire que les visiteurs du site verront (en plus du libellé, évoqué ci-dessus).

source: To add a new prompt, click the *Add prompt* button just below the Prompts header. This will open a side drawer with a dropdown to select Prompt type.
fr: Pour ajouter un nouveau champ, cliquez sur le bouton *Ajouter un champ* sous le titre Champs. Cela ouvrira un tiroir sur le côté avec une liste déroulante pour sélectionner le type de champ.

source: On selection, the options for that type will load in the sidebar for you to edit, with a Save Changes button at the bottom of the options.
fr: À la sélection, les options pour ce type de champ seront chargés dans la barre latérale pour que vous puissiez les modifier, avec un bouton Enregistrer les changements en bas des options.

source: ![Add prompt dropdown](modulesfiles/collecting_prompts.png)
fr: ![La liste déroulante Ajouter un champ](modulesfiles/collecting_prompts.png)

source: The Collecting module has Prompt Types with options as follows:
fr: Le module Collecting a des types de champs avec des options comme suit:

source: **Item Property**: select a property from the installation's vocabularies for the visitor to use to describe the item.
fr: **Propriété de contenu**: sélectionnez une propriété parmi les vocabulaires de l'installation que les visiteurs pourront utiliser pour décrire le contenu.

source: Property: select a property from the vocabularies (example: Description)
fr: Propriété: sélectionnez une propriété parmi les vocabulaires (exemple: Description)

source: Prompt Text: If you want the prompt to be something other than the property label.
fr: Texte du champ: Si vous voulez que le champ soit autre chose que le libellé de la propriété.

source: Input type: length and kind of input box. Choose from:
fr: Type de champ: taille et type de champ. Choisissez parmi:

source: Text box (one line)
fr: Champ texte (une ligne)

source: Text box (multiple line)
fr: Champ texte (plusieurs lignes)

source: Select menu (dropdown)
fr: Menu de sélection

source: If you choose "Select menu," you will need to enter the options for the menu in the *Select Menu Options* field that will appear, with one option per line.
fr: Si vous choisissez « menu de sélection », vous devrez saisir les options du menu dans le champ *options du menu de sélection* qui apparaîtra, avec une option par ligne.

source: Item resource (will appear as dropdown)
fr: Ressource de contenu (apparaîtra comme une liste déroulante)

source: This will offer the user the choice of existing items to add as a property value. You can paste anything after the `admin/` in the url of an advanced search to load specific items.
fr: Cela donnera la possibilité à l'utilisateur de choisir parmi les contenus existants un contenu à ajouter en tant valeur de propriété. Vous pouvez collez tout ce qui se trouve après `admin/` dans l'URL d'une recherche avancée pour charger des contenus spécifiques.

source: [Custom Vocab](../modules/customvocab/) (requires that plugin to be installed). If selected, an additional dropdown will load. Use this to select from your existing Custom Vocabs. This will load as a dropdown for the users on the public side of the form.
fr: [Custom Vocab](../modules/customvocab/) (nécessite que ce plugin soit installé). Si sélectionné, une liste déroulante supplémentaire sera chargée. Utilisez la pour sélectionner parmi vos Vocabulaires Personnalisés existants. Cela sera chargé comme une liste déroulante pour les utilisateurs de la partie publique du formulaire.

source: If you have [Numeric data types](../modules/numericdatatypes/) installed, you will also have the options:
fr: Si vous avez installé [Numeric data types](../modules/numericdatatypes/), vous aurez aussi ces options:

source: Numeric timestamp
fr: Horodatage numérique

source: Numeric interval
fr: Période

source: Numeric duration
fr: Durée

source: Numeric integer
fr: Entier

source: Check the Required? box if the prompt is required.
fr: Cochez la case « Requis ? » si le champ est obligatoire.

source: **Item Media** allows visitors to add media to their item. Media Type:
fr: **Media de contenu** permet aux visiteurs d'ajouter des media à leur contenu. Type de media:

source: A dropdown for Media type, with the following options:
fr: Une liste déroulante pour le type de media, avec les options suivantes:

source: Upload one, which allows users to upload one file;
fr: Téléversement simple, qui permet aux utilisateurs de téléverser un fichier;

source: Upload multiple, which allows users to upload multiple files at once using the browser's native file picker (with shift or control keys);
fr: Téléversement multiple, qui permet aux utilisateurs de téléverser plusieurs fichiers en même temps en utilisant le sélecteur de fichier natif du navigateur (avec les touches Majuscule ou Contrôle);

source: Map (requires Mapping module);
fr: Carte (nécessite le module Mapping);

source: **Item Supplementary** additional information for the item, not linked to any particularly vocabulary or property.
fr: **Contenu complémentaire** information supplémentaire sur le contenu, sans lien avec un vocabulaire ou une propriété particulière.

source: **User Name** which will be used to assign the item owner. If the person using the form is a logged-in user of the Omeka S installation, this will autopopulate.
fr: **Nom d'utilisateur** qui sera utilisé pour assigner un propriétaire au contenu. Si la personne utilisant le formulaire est authentifié, le champ sera pré-rempli.

source: **User Email** where the person adding the item can give their email. If this is left blank, they will not receive an email with the text in the *Email Text* field.
fr: **E-mail utilisateur** où la personne ajoutant le contenu peut donner son adresse e-mail. Si le champ est laissé vide, la personne ne recevra pas d'e-mail avec le texte du champ *Texte d'e-mail*.

source: **User Private** collect additional information from the user which will be kept private.
fr: **Info utilisateur privée** collecte des informations supplémentaires sur l'utilisateur qui seront conservées de manière privée.

source: **User Public** collect additional information from the user which can be made public
fr: **Info utilisateur publique** collecte des informations supplémentaires sur l'utilisateur qui pourront être rendues publiques

source: **HTML** insert a block of HTML text into the form, for additional guidance, information, etc. The Prompt Text field for this prompt has WYSIWG formatting options.
fr: **HTML** insère un bloc de texte HTML, pour des conseils supplémentaires, des informations, etc. Le champ Texte du champ a des options de formatage WYSIWYG.

source: You can rearrange the order of prompts by dragging and dropping them using the three-line icon on the far left of the Prompt Type label.
fr: Vous pouvez réorganiser l'ordre des champs en les glissant et les déposant via l'utilisation de l'icône des trois lignes tout à gauche de libellé du type de champ.

source: ![Prompts with a red arrow pointing to the icon for dragging and dropping](modulesfiles/collecting_dragthis.png)
fr: ![Des champs avec une flèche rouge qui pointe vers l'icône de glisser/déposer](modulesfiles/collecting_dragthis.png)

source: Manage an existing form
fr: Gérer un formulaire existant

source: Once you have at least one Collecting form, they will appear on the Collecting Forms page. Click the edit button (pencil) to edit the form. Click on the form label to see more information about the form and view collected items.
fr: Une fois que vous avez au moins un formulaire de collecte, ils apparaîtront sur la page des formulaires de collecte. Cliquez sur le bouton modifier (crayon) pour modifier le formulaire. Cliquez sur le libellé du formulaire pour voir plus d'informations à son sujet et pour voir les contenus collectés.

source: The form page has two tabs: Form Information and Collected Items
fr: La page du formulaire a deux onglets: Informations du formulaire et Contenus collectés

source: Form tabs show you the existing data for label, anonymity type, and item set, along with a table of all of the prompts, in order, with their type, text, and whether they prompt is required.
fr: Les onglets du formulaire vous montre les données existantes pour le libellé, le type d'anonymat, et la collection, ainsi qu'un tableau de tous les champs, dans l'ordre, avec leur type, texte, et s'ils sont obligatoires ou non.

source: ![Form info page for "share a quote" form](modulesfiles/collecting_forminfo.png)
fr: ![Page d'informations pour le formulaire « share a quote »](modulesfiles/collecting_forminfo.png)

source: To edit the form, click the *Edit form* button in the upper right hand corner.
fr: Pour modifier le formulaire, cliquez sur le bouton *Modifier le formulaire* dans le coin supérieur droit.

source: The options are in the edit form page are the same as when adding a form.
fr: Les options dans la page de modification du formulaire sont les même qu'à la création du formulaire.

source: To edit a prompt, click the edit button (pencil) for the prompt. This will open the sidebar drawer for that prompt.
fr: Pour modifier un champ, cliquez sur le bouton modifier (crayon) en face du champ. Cela ouvrira le tiroir latéral pour ce champ.

source: ![Prompts with a red arrow pointing at the column of edit buttons](modulesfiles/collecting_edit2.png)
fr: ![Des champs avec une flèche rouge pointant vers la colonne des boutons de modification](modulesfiles/collecting_edit2.png)

source: Rearrange the order of prompts by dragging and dropping them using the three-line icon on the far left of the Prompt Type label.
fr: Réorganisez l'ordre des champs en les glissant et déposant via l'utilisateur de l'icône des trois lignes tout à gauche du libellé du type du champ.

source: Add a Collecting Form to Site Pages
fr: Ajouter une formulaire de collecte aux pages de site

source: To add a collecting form to a page:
fr: Pour ajouter un formulaire de collecte à une page:

source: Go to the page on which you want the form to appear (or add a new page for the form)
fr: Allez sur la page sur laquelle vous voulez que le formulaire apparaisse (ou ajoutez une nouvelle page pour le formulaire)

source: From the *Add New Block* sidebar select the *Collecting* block
fr: À partir de la barre latérale *Ajouter un nouveau bloc* sélectionnez le bloc *Collecte*

source: On the Collecting block, click the box for the form you want to include. You can add more than one form to the page by checking more than one box.
fr: Sur le bloc Collecte, cliquez sur la case pour le formulaire que vous voulez inclure. Vous pouvez ajouter plusieurs formulaires sur la page en cochant plusieurs cases.

source: ![Collecting block with one form, its box checked](modulesfiles/collecting_pageblock.png)
fr: ![Bloc Collecte pour un formulaire, avec sa case cochée](modulesfiles/collecting_pageblock.png)

source: Managing Collected Items
fr: Gérer les contenus collectés

source: Items added via a collecting form will appear in the Items section of the Admin Dashboard, but you will likely find it easier to manage them through the Collecting tab of the site to which through which they were collected.
fr: Les contenus ajoutés via un formulaire de collecte apparaîtront dans la section Contenus du tableau de bord d'administration, mais vous trouverez probablement plus facile de les gérer depuis l'onglet Collectes du site via lequel ils ont été collectés.

source: To see the items collected with a specific form, go to the Collecting tab in the context menu for the site and click on the form label. Then click the *Collected Items* tab.
fr: Pour voir les contenus collectés depuis un formulaire spécifique, allez dans l'onglet Collectes du menu contextuel du site et cliquez sur le libellé du formulaire. Puis cliquez sur l'onglet *Contenus collectés*.

source: ![Collected Items tab with a number of items](modulesfiles/collecting_items.png)
fr: ![L'onglet Contenus collectés avec un certain nombre de contenus](modulesfiles/collecting_items.png)

source: This tab has a table of collected items with their: Title, the Date Submitted, Reviewed By, Status, and ellipses (three dots).
fr: Cet onglet a un tableau des contenus collectés avec les champs suivants: Titre, Date de soumission, Examiné par, Statut, et ellipses (trois points).

source: To see the collected information, including user name, email, etc, for any item, click on the more info ellipses. Clicking on an item title will take you to the item's edit page (under Items not the site's context menu).
fr: Pour voir les informations collectées, y compris le nom d'utilisateur, l'adresse e-mail, etc., pour chacun des contenus, cliquez sur les trois points. Cliquez le titre du contenu vous emmènera vers la page de modification du contenu (dans la section Contenus, et non le menu contextuel du site).

source: A collected item can have one of three status messages: Needs Review, Public, and Private. To change the status of an item, select the desired status from the dropdown and then click the *Update statuses* button in the upper right corner.
fr: Un contenu collecté peut avoir l'un de ces trois messages de statut: A besoin d'une revue, Public, Privé. Pour modifier le statut d'un contenu, sélectionnez le statut voulu depuis la liste déroulante et cliquez sur le bouton *Mettre à jour les statuts* dans le coin supérieur droit.

source: When you update the status of an item from "Needs Review" to either "Public" or "Private", your name will appear in the row for that item as the user the item has been *Reviewed by*. If you have multiple people working on a site, this can help you keep track of who has approved the collected items.
fr: Quand vous mettez à jour le statut d'un contenu de « A besoin d'une revue » à « Public » ou « Privé », votre nom apparaîtra dans la ligne de ce contenu en tant que l'utilisateur qui a révisé le contenu. Si vous avez plusieurs personnes qui travaillent sur un site, ça peut vous aider à suivre qui a approuvé les contenus collectés.
