Repository: omeka/omeka-s-enduser
Catalog: locales/*/LC_MESSAGES/docs/admin/users.po
Languages: fr_fr

source: Users
fr_fr: Utilisateurs

source: Only site and global administrators can create, edit, and delete users. Editors, Reviewers, Authors, and Researchers can edit their own user information but cannot change the information of other users.
fr_fr: Seuls les administrateurs de site et globaux peuvent créer, éditer et supprimer des utilisateurs. Les éditeurs, les relecteurs, les auteurs et les chercheurs peuvent modifier leurs propres informations utilisateur mais ne peuvent pas modifier les informations des autres utilisateurs.

source: Administrators manage and create users from the User tab of the main administrative dashboard (head and shoulders icon).
fr_fr: Les administrateurs gèrent et créent des utilisateurs à partir de l'onglet Utilisateur du tableau de bord administratif principal (icône personnage).

source: This Users section displays the user’s email followed by full name in parentheses, as well as their role and the date the account was created.
fr_fr: Cette section Utilisateurs affiche le courrier électronique de l’utilisateur suivi du nom complet entre parenthèses, ainsi que leur rôle et la date de création du compte.

source: There are six user roles in Omeka S:
fr_fr: Omeka S comprend six rôles d'utilisateur:

source: Global Admin: full installation privileges
fr_fr: Administrateur global: tous les droits

source: Supervisor: robust site and content privileges
fr_fr: Administrateur de site: droits de gestion de site et des ressources

source: Editor (Content Expert): full privileges for content creation
fr_fr: Éditeur (Expert du contenu): droits complets sur la création de contenu

source: Reviewer: robust content privileges but can only delete own content.
fr_fr: Relecteur: droits sur les ressources mais peut uniquement supprimer ses propres ressources.

source: Author: Create own content.
fr_fr: Auteur: créer ses propres ressources.

source: Researcher: Search and read privileges only.
fr_fr: Chercheur: rechercher et droits en lecture uniquement.

source: Create a New User
fr_fr: Créer un nouvel utilisateur

source: To create a new user, select the *Add new user* button in the upper right hand corner of the Users section in the main administrative dashboard.
fr_fr: Pour créer un nouvel utilisateur, sélectionnez le bouton *Ajouter un nouvel utilisateur* dans le coin supérieur droit de la section Utilisateurs du tableau de bord.

source: On the Add User page, enter the following:
fr_fr: Sur la page Ajouter un utilisateur, entrez les informations suivantes:

source: *Name* (full name or credit name)
fr_fr: *Nom à afficher* (nom complet ou pseudo)

source: *Email address*
fr_fr: *Email*

source: Select a *Role* using the dropdown menu (see above for user role privileges)
fr_fr: Choisissez un *Rôle* en utilisant la liste déroulante (voir les droits ci-dessus)

source: Check the *Is Active* box to confirm that the user is active.
fr_fr: Cochez la case *Est actif* pour confirmer que l'utilisateur est actif.

source: ![Add new user form with fields as described](adminfiles/users_addnew.png)
fr_fr: ![Ajouter un nouveau formulaire utilisateur avec les champs comme décrit](adminfiles/users_addnew.png)

source: Managing Users
fr_fr: Gérer les utilistateurs

source: To manage an existing user, go to the Users section.
fr_fr: Pour gérer un utilisateur existant, accédez à la section Utilisateurs.

source: ![Manage users view, top row is the Omeka Devs account. The drawer showing the number of items and item sets created by the Omeka Devs user is opened.](adminfiles/users_table.png)
fr_fr: ![Gérer la vue des utilisateurs, la première ligne correspond au compte Omeka Devs. L'onglet indiquant le nombre d'éléments et de jeux d'éléments créés par l'utilisateur Omeka Devs est ouvert.](adminfiles/users_table.png)

source: To view the name, email, and role of a user, click on the username.
fr_fr: Pour afficher le nom, l'adresse électronique et le rôle d'un utilisateur, cliquez sur le nom d'utilisateur.

source: To see the items and item sets owned by a user, click the *more* (ellipses) button located between the *delete* (trash can) button and the user role label. This will open a drawer on the right side of the screen with this information; you can click on the number of items or item sets to go to the items or item sets created by that user.
fr_fr: Pour afficher les contenus et les collections appartenant à un utilisateur, cliquez sur le bouton *plus* (trois petits points) situé entre le bouton *supprimer* (corbeille) et le libellé du rôle de l'utilisateur. Cela ouvrira un onglet sur le côté droit de l'écran avec cette information; vous pouvez cliquer sur le nombre de contenus ou de collections pour accéder aux contenus ou aux collections créés par cet utilisateur.

source: Edit User
fr_fr: Modifier l'utilisateur

source: To edit a user’s information, change their password, or access API keys, go to the Users section. Find the user on the table and click the edit icon (pencil) on their row in the table.
fr_fr: Pour modifier les informations d’un utilisateur, modifier son mot de passe ou accéder aux clés de l’API, accédez à la section Utilisateurs. Recherchez l'utilisateur dans le tableau et cliquez sur l'icône d'édition (crayon) située sur sa ligne dans le tableau.

source: ![A single row of the user table, with the user's email blanked out. A blue circle highlights the edit icon, represented as a red pencil.](adminfiles/users_editbutton.png)
fr_fr: ! Une seule ligne du tableau utilisateur, avec le courrier électronique de l'utilisateur masqué. Un cercle bleu surplombe l'icône d'édition, représentée par un crayon rouge.](adminfiles/users_editbutton.png)

source: The Edit User page has four tabs: *User Information*, *User Settings*, *Password*, and *API Keys*. After making changes on any of these tabs, be sure to click the save button in the upper right hand corner of the browser window. At any time you may cancel your edits by clicking the cancel button next to the save button.
fr_fr: La page Modifier un utilisateur comporte quatre onglets: *Informations de l'utilisateur*, *Paramètres utilisateur*, *Mot de passe* et *Clé API*. Après avoir apporté des modifications à l’un de ces onglets, veillez à cliquer sur le bouton Enregistrer dans le coin supérieur droit de la fenêtre du navigateur. À tout moment, vous pouvez annuler vos modifications en cliquant sur le bouton Annuler situé en regard du bouton Enregistrer.

source: User information
fr_fr: Informations de l'utilisateur

source: On this tab, you can edit the display *Name* and *Email* for the user, select or change the user *Role* and click the checkbox to confirm that the user *Is Active* (or uncheck the checkbox to render the user inactive)
fr_fr: Sur cet onglet, vous pouvez modifier l'affichage *Nom* et *Email* de l'utilisateur, sélectionner ou modifier le *Rôle* de l'utilisateur et cliquer sur la case à cocher pour confirmer que l'utilisateur *est actif* (ou décocher la case pour rendre l'utilisateur inactif)

source: ![User information tab for the Omeka Devs user with completed fields for email, display name, role, and an active checkbox for Is Active](adminfiles/users_info.png)
fr_fr: ![Onglet informations utilisateur pour l'utilisateur Omeka avec les champs remplis pour l'email, le nom complet, le rôle et la case à cocher active pour Est actif](adminfiles/users_info.png)

source: User settings
fr_fr: Paramètres utilisateur

source: This tab allows a user or global admin to set the following:
fr_fr: Cet onglet permet à un utilisateur ou à un administrateur général de définir les éléments suivants:

source: *Locale*: select from a dropdown of available languages. This will change the language in which the installation's admin site displays for that user.
fr_fr: *Paramètres régionaux*: sélectionnez un menu déroulant parmi les langues disponibles. Cela modifiera la langue d'affichage du site d'administration pour cet utilisateur.

source: *Default resource template*: select from existing templates to have a template auto-load whenever the user creates a new item.
fr_fr: *Modèle de ressource par défaut*: sélectionnez parmi les modèles existants pour charger automatiquement un modèle à chaque fois que l'utilisateur crée un nouveau contenu.

source: ![User settings for Omeka Dev with default options selected](adminfiles/users_settings.png)
fr_fr: ![Paramètres utilisateur pour Omeka avec les options par défaut sélectionnées](adminfiles/users_settings.png)

source: Password
fr_fr: Mot de passe

source: On this tab, create a new password. It must be entered twice, in both the *new password* and *confirm new password* fields to take.
fr_fr: Sur cet onglet, créez un nouveau mot de passe. Il doit être saisi deux fois, dans les champs *nouveau mot de passe* et *confirmer le nouveau mot de passe*.

source: ![Empty password reset fields for the user outreach](adminfiles/users_password.png)
fr_fr: ![Champs vides de réinitialisation du mot de passe pour l'utilisateur](adminfiles/users_password.png)

source: To see the password requirements, click the arrow next to the New Password field. This will display a list of [requirements](../configuration) if any have been configured.
fr_fr: Pour voir les exigences en matière de mot de passe, cliquez sur la flèche en regard du champ Nouveau mot de passe. Cela affichera une liste de [conditions requises](../configuration), le cas échéant.

source: API Key
fr_fr: Clé API

source: Use this tab to generate an API key for the user. You must provide a label for the key - this could be a date or the purpose of the key. Click save to generate the key.
fr_fr: Utilisez cet onglet pour générer une clé API pour l'utilisateur. Vous devez fournir un libellé pour la clé - il peut s’agir d’une date ou du but de la clé. Cliquez sur Enregistrer pour générer la clé.

source: To remove existing API keys, check the *Delete?* box on the row for that key and click save.
fr_fr: Pour supprimer les clés d'API existantes, cochez la case *Supprimer?* sur la ligne correspondant à cette clé, puis cliquez sur Enregistrer.

source: ![API tab for user Omeka Devs with one generated but hidden api key, and below it the ability to create a new key](adminfiles/users_apikey.png)
fr_fr: ![Onglet API pour l'utilisateur Omeka avec une clé d'API générée mais cachée et, en dessous, la possibilité de créer une nouvelle clé](adminfiles/users_apikey.png)

source: Batch edit users
fr_fr: Modifier les utilisateurs par lot

source: You can edit multiple users at one time by using the checkboxes to the left of each user's email in the User table.
fr_fr: Vous pouvez modifier plusieurs utilisateurs à la fois en utilisant les cases à cocher situées à gauche du courrier électronique de chaque utilisateur dans le tableau Utilisateurs.

source: Click the checkboxes to select the users you want to edit.
fr_fr: Cliquez sur les cases à cocher pour sélectionner les utilisateurs que vous souhaitez modifier.

source: ![A close up of the users table showing only the checkboxes and email column, with three users' emails. Two of the user's boxes are checked, and the third is unchecked.](adminfiles/users_batch1.png)
fr_fr: ![Un gros plan du tableau des utilisateurs ne montrant que les cases à cocher et la colonne email, avec les emails de trois utilisateurs. Deux des cases de l'utilisateur sont cochées et la troisième est désélectionnée.](adminfiles/users_batch1.png)

source: Then, using the dropdown just above the table, select from the following options:
fr_fr: Ensuite, à l'aide du menu déroulant situé juste au-dessus du tableau, sélectionnez l'une des options suivantes:

source: Edit selected (users)
fr_fr: Modifier sélectionnés (utilisateurs)

source: Edit all (users)
fr_fr: Modifier tout (utilisateurs)

source: Delete selected (users)
fr_fr: Supprimer sélectionnés (utilisateurs)

source: Delete all (users)
fr_fr: Supprimer tout (utilisateurs)

source: To edit only the users whose checkboxes you have ticked, choose "Edit selected" from the dropdown and then click "Go". You will be directed to the Batch Edit Users page.
fr_fr: Pour éditer uniquement les utilisateurs dont les cases à cocher sont cochées, choisissez "Modifier sélectionnés " dans le menu déroulant, puis cliquez sur "OK". Vous serez dirigé vers la page Modifier les utilisateurs par lot.

source: ![Batch edit users page](adminfiles/users_batch2.png)
fr_fr: ![Editer par lot la page des utilisateurs](adminfiles/users_batch2.png)

source: On the right hand side of the page are the emails for the users you are editing and to whom any changes you make will be applied.
fr_fr: Sur le côté droit de la page se trouvent les courriers électroniques des utilisateurs que vous modifiez et auxquels les modifications que vous apportez seront appliquées.

source: On this page you can:
fr_fr: Sur cette page, vous pouvez:

source: Set role: select from a dropdown of all roles (see below) to change the role for all selected users.
fr_fr: Définir le rôle: sélectionnez dans un menu déroulant tous les rôles (voir ci-dessous) pour modifier le rôle de tous les utilisateurs sélectionnés. +- Définir l'activité: définissez les utilisateurs sélectionnés comme actifs, non actifs ou sans changement.

source: Set activity: set selected users as active, not active, or no change.
fr_fr: Supprimer des autorisations de site: sélectionnez dans un menu déroulant les sites de l'installation d'Omeka S ou utilisez l'option "Tous les sites" pour supprimer les utilisateurs sélectionnés de tous les sites.

source: Remove from site permissions: select from a dropdown menu of the sites on the Omeka S install, or use the option "all sites" to remove the selected users from all sites.
fr_fr: Ajouter aux autorisations du site: sélectionnez dans un menu déroulant les sites de l'installation d'Omeka S ou utilisez l'option "Tous les sites" pour ajouter les utilisateurs sélectionnés à tous les sites.

source: Add to site permissions: select from a dropdown menu of the sites on the Omeka S install, or use the option "all sites" to add the selected users to all sites.
fr_fr: Ajouter aux autorisations du site sous forme de: une liste déroulante avec des options pour le visualiseur, l'éditeur ou l'administrateur - sélectionnez le rôle que les utilisateurs auront sur les sites auxquels vous les avez ajoutés.

source: Add to site permission as: a dropdown with options for viewer, editor, or admin - select which role the users will have on the sites to which you have added them.
fr_fr: Ajouter aux autorisations du site en tant que: une liste déroulante avec des options pour l'observateur, l'éditeur, ou l'administrateur - sélectionnez quel rôle les utilisateurs auront sur les sites auxquels vous les ajoutez.

source: Once you are done, click save changes.
fr_fr: Une fois que vous avez terminé, cliquez sur Enregistrer les modifications.

source: If you choose "Edit all" rather than "edit selected" you can apply changes to all users - excluding yourself - on the Omeka S installation. Use this feature carefully!
fr_fr: Si vous choisissez "Modifier tout" plutôt que "Modifié sélectionnés", vous pouvez appliquer les modifications à tous les utilisateurs - dont vous-même - sur l’installation de Omeka S. Utilisez donc cette fonctionnalité avec la plus grande précaution !

source: Delete a User
fr_fr: Supprimer un utilisateur

source: On the User page of the administrative dashboard, click the trash can icon in the user’s row, to the left of their role information, to delete the user. Confirm the deletion in the dialog box which will appear on the right of the screen.
fr_fr: Sur la page Utilisateur du tableau de bord administratif, cliquez sur l'icône corbeille située dans la ligne de l'utilisateur, à gauche des informations sur leur rôle, pour supprimer l'utilisateur. Confirmez la suppression dans la boîte de dialogue qui apparaîtra à droite de l'écran.

source: ![Delete confirmation for user Megan2, giving the number of items and item sets that user has created - in this case, zero for both.](adminfiles/users_delete.png)
fr_fr: ![Confirmation de suppression pour l'utilisateur Megan2, indiquant le nombre de contenus et de collections que l'utilisateur a créé - dans le cas présent, zéro pour les deux.](adminfiles/users_delete.png)

source: Batch delete users
fr_fr: Suppression par lot d'utilisateurs

source: To delete a number of users at once, click the checkboxes next to their names on the Users table (see Batch edit users, above).
fr_fr: Pour supprimer plusieurs utilisateurs à la fois, cochez les cases en regard de leurs noms dans le tableau Utilisateurs (voir Modification par lot d'utilisateurs, ci-dessus).

source: From the dropdown menu just above the email column, select "delete selected" and click Go.
fr_fr: Dans le menu déroulant situé juste au-dessus de la colonne de courrier électronique, sélectionnez "Supprimer la sélection", puis cliquez sur OK.

source: ![A red arrow points to the dropdown where "delete selected" is displayed](adminfiles/users_batchdel1.png)
fr_fr: ![Une flèche rouge pointe vers la liste déroulante où "supprimer la sélection" est affiché](adminfiles/users_batchdel1.png)

source: This will open a drawer on the right side of the screen with a message telling you the number of users you are about to delete. This action *cannot be undone.* To permanently delete these users, click the red Confirm Delete button. To cancel, click the x in the upper right corner of the drawer.
fr_fr: Cela ouvrira un onglet sur le côté droit de l'écran avec un message vous indiquant le nombre d'utilisateurs que vous êtes sur le point de supprimer. Cette action *ne peut pas être annulée.* Pour supprimer définitivement ces utilisateurs, cliquez sur le bouton rouge Confirmer la suppression. Pour annuler, cliquez sur le x dans le coin supérieur droit du tiroir.

source: ![Confirm delete message for 5 users](adminfiles/users_batchdel2.png)
fr_fr: ![Confirmer la suppression du message pour 5 utilisateurs](adminfiles/users_batchdel2.png)

source: The "delete all" action in the dropdown will delete all users excluding yourself. This action *cannot be undone* and should be used with extreme caution.
fr_fr: L'action "Tout supprimer" dans le menu déroulant supprimera tous les utilisateurs, à l'exclusion de vous-même. Cette action *ne peut pas être annulée* et doit être utilisée avec une extrême prudence.

source: To permanently delete these users, you must check the "Are you sure" box before clicking the "Confirm Delete" button. To cancel, click the x in the upper right corner of the drawer.
fr_fr: Pour supprimer définitivement ces utilisateurs, vous devez cocher la case "Êtes-vous sûr" avant de cliquer sur le bouton "Confirmer la suppression". Pour annuler, cliquez sur le x dans le coin supérieur droit du tiroir.

source: Roles and Permissions
fr_fr: Rôles et autorisations

source: The following is a detailed breakdown of permissions for each user role:
fr_fr: Voici une liste détaillée des autorisations pour chaque rôle d'utilisateur:

source: **Global Admin**
fr_fr: **Administrateur global**

source: Full privileges (create, edit, delete) of item, item sets, media, resource templates, site pages, sites, and users.
fr_fr: Droits complets (création, modification, suppression) sur les contenus, les collections, les médias, les modèles de contenus, les pages de site, les sites et les utilisateurs.

source: Full privileges for modules - install, activate, configure.
fr_fr: Droits complets sur les modules - installer, activer, configurer.

source: Search, read, create, and delete privileges for Vocabularies
fr_fr: Rechercher, lire, créer et supprimer des droits sur les vocabulaires

source: **Supervisor**
fr_fr: **Administrateur du site**

source: Browse-only privileges for modules in the module tab. Can interact with active modules where appropriate.
fr_fr: Droits complets (création, modification, suppression) sur les contenus, les collections, les médias, les modèles de contenus, les pages de site, les sites et les utilisateurs.

source: Search, read, and create privileges for Vocabularies (cannot delete)
fr_fr: Droits de navigation dans les modules. Les administrateurs de site peuvent interagir avec les modules actifs, le cas échéant.

source: **Editor**
fr_fr: **Éditeur**

source: Full privileges (create, edit, delete) of item, item sets, media, resource templates, and site pages
fr_fr: Droits complets (création, modification, suppression) sur les contenus, les collections, les médias, les modèles de contenus, les pages de site

source: Can search, read, and create sites and users, and edit or delete sites they own. Can only delete their own user profile.
fr_fr: Peut rechercher, lire et créer des sites et des utilisateurs, et modifier ou supprimer des sites qu’ils possèdent. Ne peut supprimer que son propre profil utilisateur.

source: Search and read only privileges for vocabularies.
fr_fr: Rechercher et lire uniquement les droits sur les vocabulaires.

source: No privileges for modules
fr_fr: Pas de droits sur les modules

source: **Reviewer**
fr_fr: **Relecteur**

source: Can search, read, create, and edit all items, item sets, and media. Can only delete those items, item sets, and media.
fr_fr: Peut rechercher, lire, créer et éditer tous les contenus, collections, médias, sites et pages de sites. Ne peut supprimer que les contenus, collections, supports, sites et pages de site dont il est propriétaire.

source: Can be added to a site at the Creator or Manager levels, which enables them to search, read, create, edit, and delete site pages. If a Reviewer has not beed added as a site user, they will have read-only access to that site's content.
fr_fr: Peut être ajouté à un site aux niveaux Créateur ou Gestionnaire, ce qui les autorise à rechercher, voir, créer, modifier, et supprimer les pages du site. Si un relecteur n'a pas été ajouté aux utilisateurs du site, il n'aura qu'un accès en lecture seule au contenu de ce site.

source: Search and read only privileges for vocabularies and resource templates.
fr_fr: Rechercher et lire uniquement les droits sur les vocabulaires et les modèles de ressources.

source: **Author**
fr_fr: **Auteur**

source: Can search, read, and create items, item sets, and media. Can only edit or delete content which the user has created.
fr_fr: Peut rechercher, lire et créer des contenus, des collections, des supports et des pages de site. Ne peut modifier ou supprimer que le contenu dont il est le créateur.

source: Search and read only privileges for vocabularies and sites.
fr_fr: Rechercher et lire uniquement les droits sur les vocabulaires et les sites.

source: **Researcher**
fr_fr: **Chercheur**

source: Search and read-only privileges for all content, sites, and users.
fr_fr: Droits de recherche et de lecture seule pour tout le contenu, les sites et les utilisateurs.
