Repository: omeka/omeka-s-enduser
Catalog: locales/*/LC_MESSAGES/docs/glossary.po
Languages: fr

source: Glossary
fr: Glossaire

source: The following glossary should help to clarify some of the less-familiar terms in Omeka S. Where appropriate, we have provided a roughly analogous term from Omeka Classic, although some analogies are stronger than others.
fr: Le glossaire suivant devrait aider à clarifier quelques-uns des termes les moins familiers dans Omeka S. Quand c'est approprié, nous avons indiqué un terme à peu près similaire dans Omeka Classic, bien que certaines similarités sont plus fortes que d'autres.

source: **Class**: A kind of Resource, as defined by a Vocabulary. Often, Vocabularies expect particular Properties to be used with particular Classes. For example, a `foaf:Person` would not have a `dcterms:publisher` Property, but could be expected to have a `foaf:familyName` Property. *Omeka Classic analogy*: Item Type
fr: **Classe**: Un type de ressource, comme défini par un vocabulaire. Souvent, les vocabulaires s'attendent à ce que des propriétés particulières soient utilisées avec des classes particulières. Par exemple, un `foaf:Person` n'aurait pas de propriété `dcterms:publisher`, mais on peut s'attendre à ce qu'il ait une propriété `foaf:familyName`. *Analogie Omeka Classic*: Type de contenu

source: **File**: Data uploaded to an Omeka S installation and associated directly with an Item (see also: Media). *Omeka Classic analogy*: File (but the analogy is weak)
fr: **Fichier**: Données téléchargées vers une installation Omeka S et associé directement avec un contenu (voir aussi: Media). *Analogie Omeka Classic*: Fichier (mais l'analogie est faible)

source: **Global Admin**: An administrator who controls everything, and is typically the person who created the Installation. *Omeka Classic analogy*: Superuser
fr: **Administrateur Global**: Un administrateur qui contrôle tout, et est typiquement la personne qui a créé l'installation. *Analogie Omeka Classic*: Superutilisateur

source: **Installation**: An instance of Omeka S. Typically, a central IT department of an institution does the process of installing, and probably also creates sites for others.
fr: **Installation**: Une instance d'Omeka S. Typiquement, un département d'informatique central d'une institution effectue le processus d'installation, et crée aussi probablement des sites pour les autres.

source: **Item**: The records used to build an Omeka S Site. Items are shared and available to any Site in an Installation, unless explicitly excluded from sharing. *Omeka Classic analogy*: Item
fr: **Contenu**: Les notices utilisées pour construire un site Omeka S. Les contenus sont partagés et disponible pour n'importe quel site dans une installation, sauf s'ils sont explicitement exclus. *Analogie Omeka Classic*: Contenu

source: **Item Set**: An aggregation of Items. Items can belong to any number of Item Sets. *Omeka Classic analogy*: Collection, Items with the same tag
fr: **Collection**: Une agrégation de contenus. Les contenus peuvent appartenir à n'importe quel nombre de collections. *Analogie Omeka Classic*: Collection, Contenus avec la même étiquette

source: **Media**: Additional representations or descriptions of an Item, beyond metadata from vocabularies. Typically, this refers to a File (of any type, including, e.g., text or HTML snippets), but could also refer to external data sources such as a YouTube video, Slideshare deck, Dspace bitstream, etc. - *Omeka Classic analogy*: File (but the analogy the weak)
fr: **Media**: Représentations additionnelles ou descriptions d'un contenu, au delà des métadonnées des vocabulaires. Typiquement, cela réfère à un fichier (de n'importe quel type, incluant, par ex., du texte ou des fragments de HTML), mais cela peut aussi renvoyer vers des sources de données externes, telles qu'une vidéo Youtube, un *deck* Slideshare, un flux de données binaires Dspace, etc. *Analogie Omeka Classic*: Fichier (mais l'analogie est faible)

source: **Property**: A defined — to one degree or another — kind of metadata used to describe a Resource. The most common is dcterms:title, for the written, human-readable title of an Item. The Values for Properties can be written language intended for humans or other sentient beings to read (‘Literals’), Resources (understood here as internal to an Omeka S Installation), or External URIs (e.g., a URI to a DBpedia resource page). *Omeka Classic analogy*: Element
fr: **Propriété**: Un type de métadonnée défini — à un degré ou à un autre — utilisé pour décrire une ressource. La plus commune est dcterms:title, pour le titre écrit et lisible par l'humain d'un contenu. Les valeurs pour les propriétés peuvent être du langage écrit destiné à être lu par des humains ou d'autres êtres sensibles (‘Littéraux’), des ressources (comprises ici comme internes à une installation Omeka S), ou des URIs externes (par exemple, une URI vers une page de ressource DBpedia). *Analogie Omeka Classic*: Élément

source: **Resource Template**: A set of pre-defined Properties, and optionally a Class, to use to guide Item creation and interpretation of Properties. Typical usage is to create a template for, e.g., a `foaf:Person` that makes Items using that template show the inputs for the expected or desired `foaf: properties`, and sets the Class of the Item to `foaf:Person`. *Omeka Classic analogy*: Item Type (but the analogy is weak) cf. Class
fr: **Modèle de ressource**: Un ensemble de propriétés pré-définies, et optionnellement une classe, pour guider la création de contenus et l'interprétation des propriétés. L'utilisation typique est de créer un modèle pour, par exemple, un `foaf:Person` qui fait que les contenus utilisant ce modèle affichent les entrées pour les `propriétés foaf:` attendues ou désirées, et définissent la classe du contenu à `foaf:Person`. *Analogie Omeka Classic*: Type de contenu (mais l'analogie est faible) cf. Classe

source: **Site Admin**: An administrator of a single Site within an Omeka S Installation. *Omeka Classic analogy*: Superuser role
fr: **Administrateur de site**: Un administrateur d'un seul site dans une installation Omeka S. *Analogie Omeka Classic*: Rôle superutilisateur

source: **Value**: The actual data that fills out the Resource-Property-Value triple. If the property is 'dcterms:title', a reasonable Value might be “Heart of Darkness”. Literal Values might also have information about the language in which that Value is expressed attached. Values can also be Resources or URIs to external data (preferably URIs that return RDF data, but I don’t think we’re going to enforce that). *Omeka Classic analogy*: Element Text
fr: **Valeur**: Les données effectives qui remplissent le triplet Ressource-Propriété-Valeur. Si la propriété est « dcterms:title », une valeur raisonnable pourrait être « Au cœur des ténèbres ». Les valeurs littérales peuvent aussi contenir des informations sur la langue dans laquelle la valeur est exprimée. Les valeurs peuvent aussi être des ressources ou des URIs vers des données externes (de préférence des URIs qui retournent des données RDF, mais je ne pense pas que nous allons imposer ça). *Analogie Omeka Classic*: Texte d'élément

source: **Vocabulary**: A collection of published RDF metadata Classes and Properties for describing a Resource. These exist and are created externally to Omeka, and can be imported (with some limitations) into Omeka S for use throughout the Installation. The most-used Vocabulary is Dublin Core Terms (dcterms:). *Omeka Classic analogy*: Element Set
fr: **Vocabulaire**: Une collection de classes et de propriétés RDF publiée pour décrire une ressource. Ils existent et sont créés indépendamment d'Omeka, et peuvent être importés (avec quelques limites) dans Omeka S pour une utilisation dans toute l'installation. Le vocabulaire le plus utilisé est Dublin Core Terms (dcterms:). *Analogie Omeka Classic*: Ensemble d'éléments
