Repository: omeka/omeka-s-enduser
Catalog: locales/*/LC_MESSAGES/docs/sites/site_pages.po
Languages: fr

source: Pages Management
fr: Gestion des pages

source: Pages form the content of your [sites](../sites/index.md). A site can have a single page or many pages.
fr: Les pages forment le contenu de vos [sites](../sites/index.md). Un site peu avoir une ou plusieurs pages.

source: Manage the pages for a site by navigating to the Sites tab on the left-hand navigation of the admin dashboard. Select the site for which you want to manage the pages and click either the title or the edit (pencil) button to edit that site.
fr: Gérez les pages de votre site en naviguant vers l'onglet Sites dans la navigation à gauche du tableau de bord d'administration. Sélectionnez le site pour lequel vous voulez gérer les pages et cliquez soit sur le titre soit sur le bouton modifier (crayon) pour modifier ce site.

source: Once you are editing the site, click the Pages tab in the left hand navigation.
fr: Maintenant que vous êtes en train de modifier le site, cliquez sur l'onglet Pages dans la navigation à gauche.

source: When you create a new site, Omeka S automatically adds a page titled *Welcome* with a single HTML block (see below). You can edit this page or delete it.
fr: Quand vous créez un nouveau site, Omeka S ajoute automatiquement une page intitulée *Bienvenue* avec un seul bloc HTML (voir ci-dessous). Vous pouvez modifier cette page ou la supprimer.

source: Adding Pages
fr: Ajouter des pages

source: From the page for the site, click the Pages tab. Then click the *Add new page* button on the upper left side of the window.
fr: Depuis la page du site, cliquez sur l'onglet Pages. Puis cliquez sur le bouton *Ajouter une nouvelle page* dans le coin supérieur droit de la fenêtre.

source: ![A red arrow points to a grey button labeled "add new page"](../sites/sitesfiles/sitepg_addnew.png)
fr: ![Une flèche rouge pointe vers un bouton gris libellé « ajouter une nouvelle page »](../sites/sitesfiles/sitepg_addnew.png)

source: To add a page you must enter a *Title*. You can also enter a *URL Slug*.
fr: Pour ajouter une page vous devez saisir un *Titre*. Vous pouvez aussi saisir un *identifiant d'URL*.

source: Both of these can be edited later but are required to create the page. If you do not enter a slug, Omeka S will create one from the page title. A slug is the page’s portion of the url and can only contain letters, numbers, and hyphens; no other characters are allowed.
fr: Ces deux éléments peuvent être modifiés plus tard mais sont nécessaires pour créer la page. Si vous ne saisissez pas d'identifiant, Omeka S en créera un à partir du titre de la page. L'identifiant est la portion d'URL pour la page et peut contenir uniquement des lettres, des chiffres et des tirets; aucun autre caractère n'est autorisé.

source: In addition, there is a checkbox for "Add to navigation". If checked, the page will automatically appear at the main [navigation](../sites/site_navigation.md) level for the site. If you do not check this box, you will have to manually add the page to the site navigation at a later point.
fr: En outre, il y a une case à cocher pour « Ajouter à la navigation ». Si elle est cochée, la page apparaîtra automatiquement au niveau principal de la [navigation](../sites/site_navigation.md) du site. Si vous ne cochez pas cette case, vous devrez manuellement ajouter la page à la navigation du site plus tard.

source: ![Page view showing the fields for Add Page](../sites/sitesfiles/sitepg_add.png)
fr: ![Vue de la page montrant les champs pour Ajouter une page](../sites/sitesfiles/sitepg_add.png)

source: The eye icon to the left of the Cancel and Add buttons is a toggle to set the visibility of your page. If the toggle is set to public (no line), then anyone can see the page. If the toggle is set to private (line through the eye icon), the page will only be visible to logged-in users of the Omeka S installation who have site permissions (Supervisors and Global Admins will always be able to see private pages).
fr: L'icône d’œil à gauche des boutons Annuler et Ajouter permet de définir la visibilité de votre page. Si la visibilité est définie à publique (pas de ligne), alors tout le monde pourra voir la page. Si elle est définie à privée (une ligne traverse l'icône d’œil), la page sera visible uniquement aux utilisateurs authentifiés de l'installation Omeka S qui ont des droits sur le site (les Superviseurs et les Administrateurs Globaux pourront toujours voir les pages privées).

source: Clicking or hitting enter on the eye icon toggles between public and private.
fr: Cliquer ou appuyer sur Entrée sur l'icône d’œil bascule entre publique et privé.

source: ![make public button showing an eye icon](../content/contentfiles/item_public.png) Public
fr: ![bouton rendre public montrant une icône d’œil](../content/contentfiles/item_public.png) Publique

source: ![make private button showing an eye icon with a diagonal slash through it](../content/contentfiles/item_private.png) Private
fr: ![bouton rendre privé montrant une icône d'œil traversé par une barre oblique](../content/contentfiles/item_private.png) Privé

source: Once you have entered this information and set visibility, click the Add button in the upper right hand corner of the browser window. You will be automatically taken to that page's edit view (see below).
fr: Une fois que vous avez saisi ces informations et défini la visibilité, cliquez sur le bouton Ajouter dans le coin supérieur droit de la fenêtre du navigateur. Vous serez automatiquement dirigé vers la vue de modification de la page (voir ci-dessous).

source: If you decide you do not want to create the page, click the Cancel button.
fr: Si vous décidez de ne pas créer la page, cliquez sur le bouton Annuler.

source: Browse Pages
fr: Parcourir les pages

source: The pages tab (once you have at least one page) will display all of your pages in their navigation order. Child pages will display below the parent page with a `-` before the page title.
fr: L'onglet pages (une fois que vous avez au moins une page) affichera toutes vos pages dans leur ordre de navigation. Les pages enfant seront affichées sous leur parent avec un `-` devant le titre de la page.

source: Every page is listed with its *Title*, buttons to view (box with an arrow coming out), edit (pencil), or delete (trash can) the page, and the page's slug.
fr: Chaque page est listée avec son *Titre*, des boutons pour voir (boîte avec une flèche sortante), modifier (crayon), ou supprimer (poubelle) la page, ainsi que l'identifiant de la page.

source: ![A sites page browse view, with 12 pages listed, some of which are child pages of the others.](../sites/sitesfiles/sitepg_browse.png)
fr: ![La vue parcourir les pages, avec 12 pages listées, dont certaines sont des pages enfant.](../sites/sitesfiles/sitepg_browse.png)

source: Use the [Navigation](../sites/site_navigation/) tab of the site admin to set the order of pages, including setting child and parent pages.
fr: Utilisez l'onglet [Navigation](../sites/site_navigation/) de l'administration du site pour définir l'ordre des pages, y compris définir la parenté des pages.

source: Editing Pages
fr: Modifier les pages

source: After clicking the Pages tab, select the page you wish to edit by clicking the name of the page or the edit button (pencil). Note: clicking on the Page *title* will take you to the public view of that page.
fr: Après avoir cliquer sur l'onglet Pages, sélectionnez la page que vous voulez modifier en cliquant sur le nom de la page ou le bouton modifier (crayon). Note: cliquer sur le *titre* de la page vous emmènera vers la vue publique de cette page.

source: The edit view for a page will display the page's title across the top. In the upper left is the public/private toggle (the eye icon), and buttons to view the public version (opens in a new tab), delete the page, cancel changes, or save changes. Note that changes will not display on the public view until after they have been saved.
fr: La vue modification d'une page affichera le titre de la page en haut. Dans le coin supérieur gauche se situe le bouton public/privé (l'icône d'oeil), et les boutons pour voir la version publique (s'ouvre dans un nouvel onglet), supprimer la page, annuler les modifications, ou enregistrer les modifications. Notez que les modifications ne s'afficheront pas sur la vue publique tant qu'elles n'auront pas été enregistrées.

source: At the top of the work area are fields for the page title and URL slug. You can edit these at any time, but remember that the slug must be unique within the site (you cannot have two pages with the slug "welcome" on the same site).
fr: En haut de la zone de travail se situent les champs pour le titre de la page et l'identifiant d'URL. Vous pouvez les modifier à n'importe quel moment, mais souvenez-vous que l'identifiant doit être unique dans tout le site (vous ne pouvez pas avoir deux pages avec l'identifiant « bienvenue » sur un même site).

source: ![A page in edit view, with one media block added](../sites/sitesfiles/sitepg_edit.png)
fr: ![Une page en vue modification, avec un bloc media ajouté](../sites/sitesfiles/sitepg_edit.png)

source: On the right hand side you can choose to add a new block by selecting one of the following layouts:
fr: Sur la droite vous pouvez choisir d'ajouter un nouveau bloc en sélectionnant parmi les configurations suivantes:

source: Page title
fr: Titre de page

source: Media Embed
fr: Media embarqué

source: Browse preview
fr: Aperçu des ressources

source: Item showcase
fr: Vitrine de contenus

source: List of sites
fr: Liste des sites

source: Table of contents
fr: Table des matières

source: Line break
fr: Saut de ligne

source: Item with metadata If you have the relevant modules installed, you may also have:
fr: Contenus avec métadonnées Si vous avez les modules correspondants installés, vous pouvez aussi avoir:

source: Map
fr: Carte

source: Collecting
fr: Collectes

source: Once you have added blocks to your page, click the Save button in the right hand corner. To leave without saving changes, click Cancel.
fr: Une fois que vous avez ajouté des blocs à votre page, cliquez sur le bouton Enregistrer dans le coin supérieur droit. Pour partir sans enregistrer les changements, cliquez sur Annuler.

source: You can delete any of the blocks by clicking on the trash can icon located in the upper right corner of the block.
fr: Vous pouvez supprimer n'importe quel bloc en cliquant sur l'icône de poubelle située dans le coin supérieur droit du bloc.

source: ![The “media” block is marked for deletion and thus highlighted in red.](../sites/sitesfiles/sitepg_delblock.png)
fr: ![Le bloc « media » est marqué pour la suppression et donc mis en évidence en rouge.](../sites/sitesfiles/sitepg_delblock.png)

source: Change the order of blocks by clicking on the three horizontal lines on the upper left corner of the block and then dragging and dropping it to the desired location.
fr: Changez l'ordre des blocs en cliquant sur les trois lignes horizontales dans le coin supérieur gauche du bloc puis en le glissant et en le déposant à l'endroit souhaité.

source: Some modules may create additional blocks for your site pages. For information on working with these blocks, please see the documentation for that [module](../modules/index.md)
fr: Certains modules peuvent créer des blocs supplémentaires pour vos pages de site. Pour plus d'informations sur ces blocs, veuillez vous référer à la documentation de ce [module](../modules/index.md)

source: From the Public Side
fr: Du côté public

source: If you are on the admin side and click "View" in the upper right-hand corner of a page, it will take you to the public view for that page.
fr: Si vous êtes du côté administration et que vous cliquez sur « Voir » dans le coin supérieur droit de la page, vous allez être redirigé vers la vue publique de cette page.

source: As you are browsing the public side of your site, you can edit the page you are viewing if you are currently logged in and the [user bar option is turned on in Site Settings](site_settings.md#general-settings).
fr: Pendant que vous naviguez sur le côté public de votre site, vous pouvez modifier la page que vous êtes en train de regarder si vous êtes authentifié et que [l'option de la barre utilisateur est activée dans les paramètres du site](site_settings.md#general-settings).

source: The user bar, which appears across the top of the page, includes a link to edit the current page - circled in red in the below image.
fr: La barre utilisateur, qui apparaît en haut de la page, contient un lien qui permet de modifier la page actuelle - entourée en rouge dans l'image ci-dessous.

source: ![User bar for a page from the site Jane Austen, with "Edit page" circled in red](../sites/sitesfiles/sitepg_edit_public.png)
fr: ![La barre utilisateur pour le site Jane Austen, avec « Modifier la page » entouré en rouge](../sites/sitesfiles/sitepg_edit_public.png)

source: Page Blocks
fr: Blocs de page

source: Pages are made up of blocks, each of which has a different form of content.
fr: Les pages sont faites de blocs, chacun d'eux ayant une forme différente de contenu.

source: Creates an HTML box in which you can add formatted text and links. When you click in the box, a formatting menu will display above the text field.
fr: Crée une boîte HTML dans laquelle vous pouvez ajouter du texte formaté et des liens. Quand vous cliquez dans la boîte, un menu de formatage s'affichera au dessus du champ texte.

source: Basic block:
fr: Bloc basique:

source: ![Page block for HTML content](../sites/sitesfiles/sitepg_html.png)
fr: ![Bloc de page pour du contenu HTML](../sites/sitesfiles/sitepg_html.png)

source: With formatting menu open:
fr: Avec le menu de formatage ouvert:

source: ![Page block for HTML content with active field, showing formatting menu](../sites/sitesfiles/sitepg_html2.png)
fr: ![Bloc de page pour du contenu HTML avec le champ actif, montrant le menu de formatage](../sites/sitesfiles/sitepg_html2.png)

source: You can embed content from elsewhere on the internet using iFrames or other embed codes in the HTML block.
fr: Vous pouvez intégrer du contenu depuis n'importe où sur internet en utilisant des iframes ou d'autres codes d'intégrations dans le bloc HTML.

source: Click into the HTML block content area to show the formatting menu and then click on the button labeled "Source". ![HTML block with formatting menu open. A red arrow points to the Source button](../sites/sitesfiles/sitepg_htmlSource1.png)
fr: Cliquez dans la zone de contenu du bloc HTML pour afficher le menu de formatage puis cliquez sur le bouton libellé « Source ». ![Bloc HTML avec le menu de formatage ouvert. Une flèche rouge pointe vers le bouton Source](../sites/sitesfiles/sitepg_htmlSource1.png)

source: This will open a dialog box where you can write HTML content.
fr: Cela ouvrira une boîte de dialogue où vous pouvez écrire du contenu HTML.

source: Copy and paste the embed code into the source code editor. ![Source box open with a short paragraph of text and an iframe from Vimeo](../sites/sitesfiles/sitepg_htmlSource2.png)
fr: Copiez et collez le code d'intégration dans l'éditeur de code source. ![La boîte de source ouverte avec un court paragraphe de texte et une iframe venant de Vimeo](../sites/sitesfiles/sitepg_htmlSource2.png)

source: Click the green OK button at the bottom of the editor.
fr: Cliquez sur le bouton vert OK en bas de l'éditeur.

source: Your embed should show up in the HTML block either as a gray rectangle or as the embedded content. ![HTML block showing the text and an embedded video](../sites/sitesfiles/sitepg_htmlSource3.png)
fr: Votre code d'intégration devrait s'afficher dans le bloc HTML soit comme un rectangle gris soit comme le contenu intégré. ![Bloc HTML montrant le texte et une vidéo intégrée](../sites/sitesfiles/sitepg_htmlSource3.png)

source: Page Title
fr: Titre de page

source: Displays the title of the current page.
fr: Affiche le titre de la page actuelle.

source: ![Page block display site's title](../sites/sitesfiles/sitepg_title.png)
fr: ![Le bloc de page affiche le titre du site](../sites/sitesfiles/sitepg_title.png)

source: Creates a block with one or more pieces of media associated with items in the item pool. In media blocks, multiple attachments stack vertically.
fr: Crée un bloc avec un ou plusieurs media associés à des contenus du réservoir de contenus. Dans les blocs media, les pièces jointes s'empilent de manière verticale.

source: ![media block with no media attached](../sites/sitesfiles/sitepg_media.png)
fr: ![bloc media sans media attaché](../sites/sitesfiles/sitepg_media.png)

source: The Media block has options for the display of the media:
fr: Le bloc Media a des options pour l'affichage des media:

source: Thumbnail type: choose from large, medium, and square.
fr: Type de vignette: choisissez entre grand, moyen, et carré.

source: Thumbnail alignment: float left, float right, and center.
fr: Alignement de la vignette: gauche, droite, et centré.

source: Set the attachment title as:
fr: Définissez le titre de la pièce jointe:

source: item title (title of the attached item);
fr: le titre du contenu (le titre du contenu attaché);

source: media title (title of the specific piece of media you select associated with the item); or
fr: le titre du media (le titre du media spécifique que vous sélectionnez pour être associé au contenu); or

source: no title.
fr: aucun titre.

source: *Layout note:* If you want media to appear beside a block of text, place a media block *above* an HTML block, select a smaller thumbnail size, and choose either float left or right for alignment. In the example below, the media has a thumbnail type of "medium", alignment "float right," and attachment title of the "item title":
fr: *Note de mise en page:* Si vous voulez que le media apparaisse à côté d'un bloc de texte, placez le bloc de media au-dessus d'un bloc HTML, sélectionnez une taille de vignette plus petite, et choisissez l'alignement gauche ou droite. Dans l'exemple ci-dessous, le media a un type de vignette « moyen », l'alignement est « droite », et le titre de la pièce jointe est « titre du contenu »:

source: ![A block of lorem ipsum text with a right-aligned small image embedded at the top of the paragraph](../sites/sitesfiles/sitepg_mediaalign.png)
fr: ![Un block de texte lorem ipsum avec une petite image alignée à droite et intégrée dans le haut du paragraphe](../sites/sitesfiles/sitepg_mediaalign.png)

source: Placing a media block *after* an HTML block will cause the media to appear below the end of the HTML paragraphs.
fr: Placer un bloc de media après un bloc HTML provoquera l'affichage du media sous les paragraphes HTML.

source: To **add media to the block**, click the *add attachment* button.
fr: Pour **ajouter un media au bloc**, cliquez sur le bouton *ajouter une pièce jointe*.

source: On loading, the drawer will show a list of your items, most recent first. You can select from the first page, page through using the forward and back arrows, or search using the search bar. You can select from the first page, page through using the forward and back arrows, or search using the search bar.
fr: Au chargement, le tiroir montrera une liste de vos contenus, les plus récents d'abord. Vous pouvez sélectionner depuis la première page, naviguer à travers les pages en utilisant les flèche avant et arrière, ou rechercher en utilisant la barre de recherche.

source: ![Select item drawer](../sites/sitesfiles/sitepg_selectitem.png)
fr: ![Tiroir de sélection de contenu](../sites/sitesfiles/sitepg_selectitem.png)

source: If you have a large number of items to navigate, or multiple items with the same title, you can use the "Filter search" options by clicking the triangle button to the right of its label.
fr: Si vous avez un grand nombre de contenus à parcourir, ou plusieurs contenus avec le même titre, vous pouvez utiliser les options « Filtrer la recherche » en cliquant le bouton triangulaire à droite de son libellé.

source: These options are:
fr: Ces options sont:

source: Filter by class: opens a dropdown to select from all of the classes for the vocabularies in the Omeka S installation.
fr: Filtrer par classe: ouvre une liste déroulante pour sélectionner parmi toutes les classes des vocabulaires de l'installation Omeka S.

source: Filter by item set: opens a dropdown to select from all item sets in the installation, not just those associated with the site on which you are working.
fr: Filtrer par collection: ouvre une liste déroulante pour sélectionner parmi toutes les collections de l'installation, pas seulement celles associées au site sur lequel vous êtes en train de travailler.

source: Filter by item id: you can put in the specific item id for an item (the number which appears in the url when you are looking at the item on the admin).
fr: Filtrer par identifiant de contenu: vous pouvez saisir un identifiant de contenu spécifique (le numéro qui apparaît dans l'URL quand vous regardez le contenu depuis l'administration).

source: Once you have applied your changes to the filter, you must click the search button (magnifying glass) to apply the filters or run the search. ![Select item drawer with filter options displayed](../sites/sitesfiles/sitepg_selectitemFilter.png)
fr: Une fois que vous avez appliqué vos modifications au filtre, vous devez cliquez sur le bouton de recherche (loupe) pour appliquer les filtres ou lancer la rechercher. ![Tiroir de sélection de contenu avec les options de filtre affichées](../sites/sitesfiles/sitepg_selectitemFilter.png)

source: Once you’ve selected an item, the drawer will shift to that item’s information. You can add a caption and select which media (if more than one) you want to use. To return to the list of items, click the *Select item* button at the top of the drawer. To use the item displayed and apply the caption, etc, click the *Apply changes* button at the bottom of the drawer.
fr: Une fois que vous avez sélectionner un contenu, le tiroir va basculer vers les informations de ce contenu. Vous pouvez ajouter une légende et sélectionner quel media (s'il y en a plusieurs) vous voulez utiliser. Pour revenir à la liste des contenus, cliquez sur le bouton *Changer le contenu* en haut du tiroir. Pour utiliser le contenu affiché et appliquer la légende, etc., cliquez sur le bouton *Appliquer les changements* en bas du tiroir.

source: ![Item view with apply changes option](../sites/sitesfiles/sitepg_applyitem.png)
fr: ![Vue de contenu avec l'option appliquer les changements](../sites/sitesfiles/sitepg_applyitem.png)

source: To add multiple items at once, click the "quick add" slider just above the list of items in the right hand drawer. This will add a checkbox to the left of each item. Check the boxes of those items you want to add to the block, then click the "Add selected" button at the bottom of the drawer.
fr: Pour ajouter plusieurs contenus en même temps, cliquez sur le curseur « ajout rapide » au-dessus de la liste des contenus dans le tiroir à droite. Cela ajoutera une case à cocher à la gauche de chaque contenu. Cochez les cases des contenus que vous voulez ajouter au bloc, puis cliquez sur le bouton « Ajouter la sélection » en bas du tiroir.

source: ![Select item drawer with quick add activated - every item in the view now has a checkbox.](../sites/sitesfiles/sitepg_selectitemQuick.png)
fr: ![Tiroir de sélection de contenu avec l'ajout rapide activé - chaque contenu dans la vue a maintenant une case à cocher.](../sites/sitesfiles/sitepg_selectitemQuick.png)

source: Browse Preview
fr: Aperçu des ressources

source: Allows you to add a block of items on a site page.
fr: Permet d'ajouter un bloc de contenus dans une page de site.
