Repository: omeka/omeka-s-enduser
Catalog: locales/*/LC_MESSAGES/docs/sites/site_settings.po
Languages: fr

source: Site Admin
fr: Administration du site

source: The Site Admin page allows you to manage the main settings for the [site](../sites/index.md) on which you are working. Changes will only be applied to this site and will not change other sites' settings.
fr: La page d'administration du site vous permet de gérer les paramètres principaux du [site](../sites/index.md) sur lequel vous travaillez. Les modifications seront uniquement appliquées à ce site et ne modifieront pas les paramètres des autres sites.

source: It is the first tab under the site title, represented with a gear icon.
fr: C'est le premier onglet sous le titre du site, représenté par une icône d'engrenage.

source: The Site Admin page has two tabs, Info and Settings.
fr: La page d'administration du site a deux onglets, Informations et Paramètres.

source: Info
fr: Informations

source: The site info settings for an Omeka S site are where you can change the basic info for the site - the same information you entered when you created the site. You can change the:
fr: Les paramètres d'informations du site pour un site Omeka S sont l'endroit où vous pouvez modifier les informations basiques du site - les mêmes informations que vous saisissez à la création d'un site. Vous pouvez changer:

source: *title* - a text field.
fr: le *titre* - un champ texte.

source: *slug* - the url for your site.
fr: *l'identifiant* - l'URL de votre site.

source: *summary* - the brief description of what it is about which will appear on your installation's landing page and on [List of Site](site_pages.md#page-blocks) blocks.
fr: le *résumé* - une description brève du site qui apparaîtra sur la page d'accueil de votre installation et sur les blocs [Liste des sites](site_pages.md#page-blocks).

source: ![Site info for the site “Jane Austen” with buttons across the top to View, Delete, and Save the site](../sites/sitesfiles/sites_siteinfo.png)
fr: ![Informations du site « Jane Austen » avec les boutons en haut pour Voir, Supprimer et Enregistrer le site](../sites/sitesfiles/sites_siteinfo.png)

source: In the upper right hand corner of the window on this tab, you can use buttons to:
fr: Dans le coin supérieur droit de la fenêtre de cet onglet, vous pouvez utiliser les boutons pour:

source: set your site as public or private using the eye icon button (see below);
fr: rendre votre site public ou privé en utilisant l'icône d’œil (voir ci-dessous);

source: *delete* the site;
fr: *supprimer* le site;

source: *cancel* making changes; and
fr: *annuler* les changements; et

source: *Ssave* changes.
fr: *Enregistrer* les changements.

source: The *make public/private* button (eye icon) is used to both indicate and set whether the site is visible to the public or only to users of this Omeka S installation
fr: Le bouton *rendre public/privé* (icône d’œil) est utilisé à la fois pour indiquer et modifier si le site est visible publiquement ou uniquement par les utilisateurs de cette installation Omeka S

source: Site is public: ![make public button showing an eye icon](../content/contentfiles/item_public.png) Site is Private: ![make private button showing an eye icon with a diagonal slash through it](../content/contentfiles/item_private.png)
fr: Le site est public: ![bouton rendre public montrant une icône d’œil](../content/contentfiles/item_public.png) Le site est privé: ![bouton rendre privé montrant une icône d’œil traversée par une barre oblique](../content/contentfiles/item_private.png)

source: Settings
fr: Paramètres

source: The Settings page is divided into three sections: General, Browse, and Search.
fr: La page Paramètres est divisé en trois sections: Général, Parcourir, et Recherche.

source: To implement any changes you make, click Save at the top right of the browser window when you are done. To leave without saving changes, click cancel.
fr: Pour mettre en œuvre les changements que vous faites, cliquez sur Enregistrer dans le coin supérieur droit de la fenêtre du navigateur quand vous avez terminé. Pour partir sans enregistrer les changements, cliquez sur Annuler.

source: General settings
fr: Paramètres généraux

source: ![general settings, all at default](../sites/sitesfiles/sites_settingsgen.png)
fr: ![paramètres généraux, tous à leur valeur par défaut](../sites/sitesfiles/sites_settingsgen.png)

source: **Auto-assign new items** A checkbox which sets whether new items are automatically added to the site. If checked, every new item will be added to the site, regardless of the item's owner. Note that item owners may unassign their items from the site at any time, in the item's edit pages.
fr: **Assigner automatiquement les nouveaux contenus** Une case à cocher qui détermine si les nouveaux contenus sont automatiquement ajoutés au site. Si cochée, chaque nouveau contenu sera ajouté au site, sans tenir compte du propriétaire du contenu. Notez que les propriétaires de contenu peuvent retirer leurs contenus du site à n'importe quel moment, depuis la page de modification du contenu.

source: **Attachment link type** Sets the target of links from attachments you add to [site page blocks](site_pages.md#page-blocks) (for example, in an [item showcase](site_pages.md#item-showcase). It offers a dropdown with the following options:
fr: **Type de lien des pièces jointes** Définit la cible des liens des pièces jointes que vous ajoutez au [blocs de page de site](site_pages.md#page-blocks) (par example, dans une [vitrine de contenus](site_pages.md#item-showcase). Il propose une liste déroulante avec les options suivantes:

source: *item page:* clicking on the attachment takes users to the item page associated with the attached media;
fr: *page de contenu:* cliquer sur la pièce jointe emmène l'utilisateur vers la page du contenu associé au media joint;

source: *media page:* clicking on the attachment takes users to the media page;
fr: *page de media:* cliquer sur la pièce jointe emmène l'utilisateur vers la page de media;

source: *direct link to file:* clicking on the attachment takes user to the file alone.
fr: *lien direct vers le fichier:* cliquer sur la pièce jointe emmène l'utilisateur vers le fichier.

source: **Embed media on item pages** is a checkbox. When checked, any linked media (such as videos) will be embedded on the item pages. When unchecked, site visitors will click through to view playable media.
fr: **Intégrer le media sur les pages de contenu** est une case à cocher. Si cochée, tous les media liés (tels que des vidéos) seront intégrés dans les pages de contenu. Si non cochée, les visiteurs du site cliqueront dessus pour voir le media.

source: **Show page pagination** is also a checkbox. When checked, "Previous" and "Next" links will display at the bottom of every page in the site, proceeding through your navigation. If unchecked, these links will not display.
fr: **Afficher la pagination de page** est aussi une case à cocher. Si cochée, les liens « Précédent » et « Suivant » seront affichés en bas de chaque page du site, pour pouvoir continuer votre navigation. Si non cochée, ces liens ne seront pas affichés.

source: **Show user bar on public views** sets whether there is a bar across the top of public site pages which allow users to access the admin side of the site.
fr: **Afficher la barre utilisateur sur les vues publiques** détermine si il y a une barre au-dessus des pages du site public ce qui permet aux utilisateurs d'accéder à la partie administration du site.

source: When users are logged in, the user bar has the following options:
fr: Quand les utilisateurs sont authentifiés, la barre utilisateur a les options suivantes:

source: Installation Title: takes you back to the installation admin
fr: Titre de l'installation: vous amène vers l'administration de l'installation

source: Site Title: takes you back to the landing page for managing the site (site/show).
fr: Titre du site: vous amène à la page principale de gestion du site (site/show)

source: Resource view: depending on what you are viewing, this is a link to the admin side management for [Pages](site_pages), [Items](../content/items), or [Item Sets](../content/item-sets)
fr: Vue ressource: selon ce que vous êtes en train de visualiser, il y a un lien vers la partie administration pour les [pages](site_pages), les [contenus](../content/items), ou les [collections](../content/item-sets)

source: Edit link for that page, item set, or item.
fr: Lien de modification pour cette page, cette collection, ou ce contenu.

source: User's display name: takes you to your user page.
fr: Nom d'affichage de l'utilisateur: vous amène vers la page utilisateur.

source: Logout: logs out current user.
fr: Déconnexion: déconnecte l'utilisateur actuel.

source: ![a blue bar across the top of the image displays the following words in light blue text, indicating a link: Stackable Sandbox, Jane Austen, Pages, Edit Page, Signed in as Megan, and a button to Logout.](../sites/sitesfiles/sites_userbarin.png)
fr: ![une barre bleue en haut de l'image affiche les mots suivants en bleu clair, indiquant un lien: Stackable Sandbox, Jane Austen, Pages, Modifier la page, Connecté en tant que Megan, et un bouton pour se déconnecter.](../sites/sitesfiles/sites_userbarin.png)

source: When users are not logged, the user bar only displays a login option.
fr: Quand les utilisateurs ne sont pas authentifiés, la barre utilisateur affiche uniquement une option de connexion.

source: ![A blue bar across the top of the image only has a small button reading "Log In". Below this, the site's title "A Tin Box" is displayed in black text on a white background.](../sites/sitesfiles/sites_userbarout.png)
fr: ![Une barre bleue en haut de l'image a seulement un petit bouton intitulé "Se connecter". En dessous, le titre du site « A Tin Box » est affiché en texte noir sur un fond blanc.](../sites/sitesfiles/sites_userbarout.png)

source: The options for this setting are:
fr: Les options pour ce paramètre sont:

source: Never
fr: Jamais

source: When identified (when logged in)
fr: Si identifié (si connecté)

source: Always
fr: Toujours

source: **Disable JSON-LD embed** Check this box to disable JSON-LD embedding on resource browse and show pages.
fr: **Désactivé le JSON-LD intégré** Cochez cette case pour désactivé l'intégration de JSON-LD sur les pages de ressources.

source: **Locale** is dropdown menu to select the language code for this site. By default this will be set to the same as the global locale setting for the entire Omeka S installation. To change, select a language from the dropdown menu.
fr: **Paramètres régionaux** est un menu déroulant qui permet de sélectionner la langue du site. Par défaut ce sera la même valeur que le paramètre global de l'installation Omeka S. Pour modifier, sélectionnez une langue dans le menu déroulant.

source: Browse settings
fr: Paramètres de consultation

source: ![browse settings, all empty](../sites/sitesfiles/sites_settingsbrowse.png)
fr: ![paramètres de consultation, tous vides](../sites/sitesfiles/sites_settingsbrowse.png)

source: **Restrict browse to attached items** is a checkbox. If checked, the Browse functions of your site will only show items which have been added to a page block. If unchecked, browse pages and blocks on your site will include all items in the Item Pool.
fr: **Restreindre la consultation aux contenus attachés** est une case à cocher. Si cochée, les fonctions de consultation de votre site montreront uniquement les contenus qui ont été ajoutés à un bloc de page. Si non cochée, les pages de consultation et les blocs sur votre site incluront tous les contenus du réservoir de contenus.

source: **Results per page** sets the number of results per page on browse pages by entering a number. If left blank, the site will use the default from the [global settings](../admin/settings).
fr: **Résultats par page** définit le nombre de résultats par page sur les pages de consultation en saisissant un nombre. Si laissé vide, le site utilisera la valeur par défaut définit dans les [paramètres globaux](../admin/settings).

source: Depending on the [site theme](../sites/site_theme), you may want to make this a multiple of 4 for a more elegant display. Note that using very large numbers (50, 75, 100) may cause browse pages to load slowly.
fr: En fonction du [thème du site](../sites/site_theme), vous voudrez peut-être mettre un multiple de 4 pour un affichage plus élégant. Notez qu'utiliser de très grands nombres (50, 75, 100) peut provoquer des lenteurs au chargement des pages.

source: **Browse heading property** sets which property to use as the heading for each resource on a browse page. By default, this is Dublin Core: Title. The dropdown allows you to select from all available vocabularies, and includes a search bar to quickly find the desired property.
fr: **Propriété pour le titre** détermine quelle propriété sera utilisé comme titre pour chaque ressource sur une page de parcours. Par défaut, c'est Dublin Core: Title. La liste déroulante vous permet de sélectionner parmi tous les vocabulaires disponibles, et contient une barre de recherche pour trouver rapidement la propriété voulue.

source: ![The browse heading property option is open. The current selection, Dublin Core: Title, is at the top. Immediately below it is a search bar, indicated by a magnifying glass symbol. Below that are some properties from the the friend of a friend vocabulary.](../sites/sitesfiles/sites_setbrowseprop.png)
fr: ![L'option de propriété pour le titre est ouverte. La sélection actuelle, Dublin Core: Title, est en haut. Immédiatement en dessous se trouve la barre de recherche, indiquée par un symbole de loupe. Sous celle-ci se trouvent certaines propriétés du vocabulaire « friend of a friend ».](../sites/sitesfiles/sites_setbrowseprop.png)

source: **Browse body property** sets which property to use as the body text for each resource on a browse page. By default, this is Dublin Core: Description. The dropdown allows you to select from all available vocabularies, and includes a search bar to quickly find the desired property.
fr: **Propriété définissant le corps, dans les listes** détermine quelle propriété sera utilisée comme corps de texte pour chaque ressource sur une page de liste. Par défaut, c'est Dublin Core: Description. La liste déroulante vous permet de sélectionner parmi tous les vocabulaires disponibles, et contient une barre de recherche pour trouver rapidement la propriété voulue.

source: Show
fr: Afficher

source: When this box is checked, site pages to which an item is attached will display on the public view of that item.
fr: Quand cette case est cochée, les pages de site auxquelles un contenu est attaché seront affichées sur la vue publique de ce contenu.

source: ![Show setting checked](../sites/sitesfiles/sites_settingShow.png)
fr: ![Paramètre afficher coché](../sites/sitesfiles/sites_settingShow.png)

source: Search
fr: Recherche

source: ![search settings, all empty](../sites/sitesfiles/sites_settingssearch.png)
fr: ![Paramètres de recherche, tous vides](../sites/sitesfiles/sites_settingssearch.png)

source: **Search type** is a dropdown which allows you to set from which site(s) the search bar generates results:
fr: **Type de recherche** est une liste déroulante qui vous permet de définir pour quel(s) site(s) la barre de recherche génère des résultats:

source: This site: only return results from this site;
fr: Ce site: retourne uniquement des résultats depuis ce site;

source: All sites: return results for all sites on the installation.
fr: Tous les sites: retourne des résultats pour tous les sites de l'installation.

source: **Search resources** is a series of checkboxes which let you select which types of resources are searched from the main search field on the site. Select from: site pages, items, and item sets. You can select all if you want.
fr: **Rechercher les ressources** est une série de cases à cocher qui vous permet de sélectionner quels types de ressources sont recherchées depuis le champ de recherche principal sur le site. Sélectionnez parmi: pages de site, contenus, et collections. Vous pouvez tous les sélectionner si vous voulez.

source: **Templates** allows you to limit the properties for advanced item or item set search to only properties included in a template or templates. When this field is empty, the "Search by Value" on the advanced search will display all properties from all vocabularies in the Omeka S installation. Applying a template not only limits the options in the dropdown, it also includes your alternate labels for properties:
fr: **Modèles** vous permet de limiter les propriétés pour la recherche avancée de contenus ou de collections aux propriétés incluses dans un ou plusieurs modèles. Si ce champ est vide, la « Recherche par Valeur » sur la recherche avancée affichera toutes les propriétés de tous les vocabulaires de l'installation Omeka S. Appliquer un modèle non seulement limite les options de la liste déroulante, mais cela apporte aussi vos libellés alternatifs pour les propriétés:

source: ![Detail view of a dropdown menu for the option 'Search by value". Values loaded include Creator:Author, Date: Date of Publication, and Description.](../sites/sitesfiles/sites_settingtemp.png)
fr: ![Vue détaillée d'un menu déroulant pour l'option « Recherche par valeur ». Les valeurs chargées incluent Créateur:Auteur, Date: Date de publication, et Description.](../sites/sitesfiles/sites_settingtemp.png)

source: Click in the field to add a template; you can add more than one template by clicking in the field again.
fr: Cliquez dans le champ pour ajouter un modèle; vous pouvez ajouter plusieurs modèles en cliquant à nouveau dans le champ.

source: **Restrict to templates** will restrict search results to only those items which are using the selected templates.
fr: **Restreindre aux modèles** restreindra les résultats de recherche aux contenus utilisant les modèles sélectionnés.
