Repository: omeka/omeka-s-enduser
Catalog: locales/*/LC_MESSAGES/docs/sites/site_pages.po
Languages: fr

source: In order to create a Browse Preview block, you'll first need to perform a search on your Omeka S installation for the items you want to include. You can use the general search on the left hand navigation or, if you want to show all items in an item set, use the Advanced Search from Items browse. NB: if you leave the search options blank, the browse preview will load all items in your site's item pool.
fr: Pour créer un bloc Aperçu des ressources, vous devez d'abord effectuer une recherche dans votre installation Omeka S pour les contenus que vous voulez inclure. Vous pouvez utilisez la recherche générale dans la navigation à gauche ou, si vous voulez montrer tous les contenus d'une collection, utilisez la recherche avancée depuis la page de parcours des contenus. NB: si vous laissez l'option de recherche vide, l'aperçu des ressource chargera tous les contenus du réservoir de contenus de votre site.

source: Once you have searched, highlight everything in your browser's address bar starting with the question mark all the way to the end of the search url (to the right).
fr: Une fois que vous avez effectué la recherche, sélectionnez tout ce qui se trouve dans la barre d'adresse du navigateur en commençant par le point d'interrogation jusqu'à la fin de l'URL de recherche (vers la droite).

source: ![a search query url with the question mark and everything to its right highlighted](../sites/sitesfiles/sitespg_bpquery.png)
fr: ![une URL de requête de recherche avec le point d'interrogation et tout ce qui est à sa droite sélectionné](../sites/sitesfiles/sitespg_bpquery.png)

source: From the *Resource type* dropdown, choose the kind of resource you want to display in the block: Items, Item Sets, or Media.
fr: Depuis la liste déroulante *Type de ressource*, choisissez le type de ressource que vous voulez afficher dans le bloc: Contenus, Collections, ou Media.

source: In the *Query* field of the Browse Preview block, paste the part of the url you just copied (everything from the question mark over).
fr: Dans le champ *Requête* du bloc d'aperçu de ressources, collez la partie de l'URL que vous venez de copier (tout à partir du point d'interrogation).

source: The *Limit* field lets you set the number of resources to display in the block; any additional results from your query can be accessed on a search page linked from the bottom of the block (you set the text of the link in the *browse link text* field below).
fr: Le champ *Limite* vous permet de définir le nombre de ressources à afficher dans le bloc; les autres contenus seront accessibles sur une page de recherche liée au bas du bloc (vous pouvez définir le texte du lien dans le champ *Texte du lien* en dessous).

source: The *Preview Title* field sets the heading above the browse section on the page.
fr: Le champ *Titre du bloc* défini le titre de la section aperçu sur la page.

source: The *Browse link text* field sets the link text at the bottom of the block - the block will only display as many results as you set in the *Limit* field above.
fr: Le champ *Texte du lien* défini le texte du lien en bas du bloc - le bloc affichera au maximum le nombre de résultats que vous avez défini dans le champ *Limite*.

source: ![Page block for Browse Preview](../sites/sitesfiles/sitepg_bpblock.png)
fr: ![Bloc de page pour l'aperçu des ressources](../sites/sitesfiles/sitepg_bpblock.png)

source: Item Showcase
fr: Vitrine de contenus

source: A list of items.
fr: Une liste de contenus.

source: In item showcase blocks, multiple attachments build horizontally, creating rows across the page.
fr: Dans les blocs vitrine de contenus, les pièces jointes s'empilent de manière horizontale, ce qui crée des lignes sur la page.

source: ![Block for item showcase with one item added](../sites/sitesfiles/sitepg_showcase.png)
fr: ![Bloc pour une vitrine de contenus avec un contenu ajouté](../sites/sitesfiles/sitepg_showcase.png)

source: Using the drop-down menu in the block, you can:
fr: En utilisant le menu déroulant dans le bloc, vous pouvez:

source: set the thumbnail size for these items as large (default), medium, or square.
fr: définir la taille de vignette pour ces images à grand (par défaut), moyen, ou carré.

source: set the attachment title as:
fr: définir le titre de la pièce jointe à:

source: Click the *Add Attachment* button to add an item to the block. This will open a drawer on the right side of the page to browse and select items.
fr: Cliquez sur le bouton *Ajouter une pièce jointe* pour ajouter un contenu au bloc. Cela ouvrira un tiroir sur le côté droit de la page pour parcourir et sélectionner des contenus.

source: Once you have applied your changes to the filter, you must click the search button (magnifying glass) to apply the filters or run the search.
fr: Une fois que vous avez appliqué vos modifications au filtre, vous devez cliquez sur le bouton de recherche (loupe) pour appliquer les filtres ou lancer la rechercher.

source: ![Select item drawer with filter options displayed](../sites/sitesfiles/sitepg_selectitemFilter.png)
fr: ![Tiroir de sélection de contenu avec les options de filtre affichées](../sites/sitesfiles/sitepg_selectitemFilter.png)

source: To cancel the item selection, click the X in the upper right corner of the drawer at any time.
fr: Pour annuler la sélection du contenu, cliquez sur le X dans le coin supérieur droit du tiroir à n'importe quel moment.

source: Once you’ve added an item, it will appear in the Item List block. You can edit the caption or media options by clicking the edit (wrench) button for that row, and you can delete the item using the delete (trash can) icon.
fr: Une fois que vous avez ajouté un contenu, il apparaîtra dans le bloc Liste de contenus. Vous pouvez modifier la légende ou les options de media en cliquant sur le bouton modifier (clé à molette) pour cette ligne, et vous pouvez supprimer le contenu en utilisant l'icône supprimer (poubelle).

source: You can add multiple items to the list.
fr: Vous pouvez ajouter plusieurs contenus à la liste.

source: This block displays a list of all of the sites on your Omeka S install. This block has the following options:
fr: Ce bloc affiche une liste de tous les sites de votre installation Omeka S. Ce bloc a les options suivantes:

source: ![List of sites block](../sites/sitesfiles/sitepg_slist1.png)
fr: ![Bloc Liste de sites](../sites/sitesfiles/sitepg_slist1.png)

source: Sort sites by: Alphabetical order (A-Z); Oldest first; newest first. By default this is set to alphabetical.
fr: Trier les sites par: Ordre alphabétique (A-Z); Plus ancien d'abord; Plus récent d'abord. Par défaut l'ordre est alphabétique.

source: Max number of sites allows you to limit the number of sites which display at once. If left blank, all sites will display.
fr: Le nombre maximum de sites vous permet de limiter le nombre de sites qui s'affichent en même temps. Si vide, tous les sites seront affichés.

source: A checkbox to turn on pagination, applied only if you set a limit.
fr: Une case à cocher pour activer la pagination, appliqué seulement si vous définissez une limite.

source: A checkbox to show site summaries.
fr: Une case à cocher pour afficher le résumé des sites.

source: A checkbox to exclude the current site from the list.
fr: Une case à cocher pour exclure le site actuel de la liste.

source: This image shows a List of sites block, sorted oldest first, with no limits:
fr: Cette image montre un bloc Liste des sites, trié par le plus ancien d'abord, sans limite:

source: This is the same block edited to have a limit of 5 and pagination is turned on:
fr: C'est le même bloc modifié pour avoir une limite de 5 et la pagination activée:

source: The same block with pagination and site summaries turned on:
fr: Le même bloc avec la pagination et le résumé des sites activés:

source: Table of Contents
fr: Table des matières

source: If the current page has child pages, you can add a table of content block for those pages.
fr: Si la page actuelle a des pages enfant, vous pouvez ajouter un bloc Table des matières pour ces pages.

source: The Depth option allows you to set how many levels of child pages you want to display. If left blank, it will display all possible levels. Please enter a whole number.
fr: L'option profondeur vous permet de définir combien de niveaux de pages enfant vous souhaitez afficher. Si vide, tous les niveaux seront affichés. Veuillez saisir un nombre entier.

source: ![Table of content block with no depth option set](../sites/sitesfiles/sitepg_toc.png)
fr: ![Bloc Table des matières avec l'option profondeur non définie](../sites/sitesfiles/sitepg_toc.png)

source: Add and arrange pages using the [Site Navigation](../sites/site_navigation.md) settings.
fr: Ajoutez et organisez les pages en utilisant les paramètres de la [Navigation du site](../sites/site_navigation.md)

source: Line Break
fr: Saut de ligne

source: Line break creates a transparent or opaque line break on the page, clearing all blocks. Select whether the line is transparent or opaque from the dropdown.
fr: Le saut de ligne crée un saut de ligne transparent ou opaque sur la page. Choisissez si la ligne doit être transparente ou opaque depuis la liste déroulante.

source: ![line break table, dropdown selected to transparent](../sites/sitesfiles/sitepg_line.png)
fr: ![tableau saut de ligne, liste déroulante définie à transparent](../sites/sitesfiles/sitepg_line.png)

source: HTML blocks wrap around Media blocks and at times you may want to clear the page. You might also want to create a visual break on the page.
fr: Les blocs HTML enveloppent les blocs Media et par moment vous pouvez avoir envie d'aérer la page. Vous pouvez aussi avoir envie de créer une cassure visuelle sur la page.

source: Item with Metadata
fr: Contenu avec métadonnées

source: This block displays an item along with all associated metadata (entered when creating or editing the [item](../content/items.md)).
fr: Ce bloc affiche un contenu avec ses métadonnées associées (saisie à la création ou modification du [contenu](../content/items.md)).

source: Add attachments in the same manner as the [media](#media-embed) page block.
fr: Ajoutez des pièces jointes de la même manière que le bloc [media](#media-embed).

source: ![Item with metadata block with nothing attached](../sites/sitesfiles/sitepg_iwm.png)
fr: ![Bloc Contenu avec métadonnées et aucune pièce jointe](../sites/sitesfiles/sitepg_iwm.png)

source: Other blocks
fr: Autres blocs

source: For module-specific blocks (like [Collecting](../modules/collecting.md) or [Map](../modules/mapping.md)) see the documentation for that module.
fr: Pour les blocs spécifiques à un module (comme [Collecting](../modules/collecting.md) ou [Map](../modules/mapping.md)) voir la documentation de ce module.

source: Deleting Pages
fr: Supprimer des pages

source: To delete a page, go the to *Pages* tab of the site of which the page is a part. Click the delete (trash can) button at the right end of the row for that page.
fr: Pour supprimer une page, allez vers l'onglet *Pages* du site qui contient cette page. Cliquez sur le bouton supprimer (poubelle) à l'extrémité droite de la ligne pour cette page.

source: A drawer will open on the right side of the page asking you to confirm that you wish to delete the page, with the name of the page displayed under the confirm button. To proceed, click the *Confirm delete* button. Otherwise, click the *X* in the upper right corner of the drawer to cancel.
fr: Un tiroir apparaîtra à droite de la page et vous demandera de confirmer que vous souhaitez supprimer la page, avec le nom de la page affiché sous le bouton de confirmation. Pour continuer, cliquez sur le bouton *Confirmer la suppression*. Sinon, cliquez sur le *X* dans le coin supérieur droit du tiroir pour annuler.

source: ![Delete drawer for the Novels page](../sites/sitesfiles/sitepg_delete.png)
fr: ![Tiroir de suppression pour la page Novels](../sites/sitesfiles/sitepg_delete.png)
