Repository: omeka/omeka-s-enduser
Catalog: locales/*/LC_MESSAGES/docs/sites/site_resources.po
Languages: fr

source: Resources
fr: Ressources

source: The Resources tab of the site context menu allows you to set what Items and Item Sets are available on your site's browse pages. The Items tab also sets which items are available in the sidebar when building pages.
fr: L'onglet Ressources du menu contextuel du site vous permet de définir quels contenus et collections sont disponibles sur les pages parcourir de votre site. L'onglet Contenus définit aussi quels contenus sont disponibles dans la barre latérale pendant la construction des pages.

source: Resources has two tabs across the top of the window: Items and Item Sets.
fr: La page Ressources a deux onglets en haut de la fenêtre: Contenus et Collections.

source: Under the Items tab, you can set the items available for selection and browse in your site.
fr: Sous l'onglet Contenus, vous pouvez définir les contenus disponibles pour la sélection et la consultation sur votre site.

source: Item Sets is where you select the sets which will show up on the Browse Item Sets page, should you choose to include it
fr: L'onglet Collections est l'endroit où vous sélectionnez les collections qui seront affichés sur la page de consultation des collections, si vous décidez de l'inclure

source: **Note** The two tabs operate *independently* from each other. The selections made on one will have no effect on the other. The Items tab limits which items are available, while the Item Set tab limits which sets are visible for public browsing.
fr: **Note** Les deux onglets opèrent *indépendamment* l'un de l'autre. Les sélections faites sur l'un n'ont aucun effet sur l'autre. L'onglet Contenus limite quels contenus sont disponibles, alors que l'onglet Collections limite quelles collections sont visible pour la consultation publique.

source: Items
fr: Contenus

source: The Items tab determines what automatically appears in the resource selection options on the [pages](../sites/site_pages.md) of your Omeka S [site](../sites/index.md). It also limits the resources which appear on a browse page on your site.
fr: L'onglet Contenus détermine ce qui apparaît automatiquement dans les options de sélection de ressource sur les [pages](../sites/site_pages.md) de votre [site](../sites/index.md) Omeka S. Il limite également les ressources qui apparaissent sur la page parcourir de votre site.

source: When you first navigate the to items tab, it will display information about the number of items in the site and give you options for making changes. You will see:
fr: Quand vous naviguez pour la première fois dans l'onglet contenus, il affichera des informations sur le nombre de contenus dans le site et vous donnera des options pour faire des changements. Vous verrez:

source: A statement of the number of items current assigned to the site. Click on the number to open a new browser tab showing all of those items.
fr: Une déclaration sur le nombre de contenus actuellement assignés au site. Cliquez sur le nombre pour ouvrir un nouvel onglet de navigateur montrant tous ces contenus.

source: A statement of whether the site automatically includes new items, and a link to the site admin to change that setting.
fr: Une déclaration sur le fait que le site inclut automatiquement ou non les nouveaux contenus, et un lien vers l'administration du site pour modifier ce paramètre.

source: A table with the following options for managing your current items: - Do nothing: make no changes) - Add - keep existing items and assign items from a new search - Replace - unassign all items and assign items from a new search - Remove - unassign items from a new search - Remove all - unassign all items
fr: Un tableau avec les options suivantes pour gérer vos contenus actuels: - Ne rien faire: ne faire aucun changement - Ajouter - garder les contenus existants et en assigner de nouveaux à partir d'une recherche - Remplacer - dés-assigner tous les contenus et assigner les contenus à partir d'une nouvelle recherche - Supprimer - dés-assigner les contenus à partir d'une nouvelle recherche - Supprimer tout - dés-assigner tous les contenus

source: ![Item resources landing for a site with 28 items](../sites/sitesfiles/sites_resources1.png)
fr: ![Page des contenus pour un site avec 28 contenus](../sites/sitesfiles/sites_resources1.png)

source: If you want to make changes to the item sources in your site, select the radio button for the action you want to take. For all but "Do nothing" and "Remove all", a search form will automatically load.
fr: Si vous voulez faire des changements dans les sources de contenus de votre site, sélectionnez le bouton radio pour l'action que vous voulez effectuer. Pour toutes les actions, à l'exception de « Ne rien faire » et « Supprimer tout », un formulaire de recherche sera chargé automatiquement.

source: ![Item resources with "replace" selected and the search form loaded](../sites/sitesfiles/sites_resources2.png)
fr: ![Contenus avec « remplacer » sélectionné et le formulaire de recherche chargé](../sites/sitesfiles/sites_resources2.png)

source: Note that the search options in the form work together to build an overall search. If you had the search in the image above, looking for items where "Creator" contains the word "Doyle" and you added a criteria where Class=Text, it would only add items to your pool which matched *both* statements.
fr: Notez que les options de recherche dans le formulaire fonctionnent ensemble pour construire une recherche globale. Si vous aviez la recherche comme dans l'image ci-dessus, chercher des contenus où « Créateur » contient le mot « Doyle » et que vous ajoutez un critère où Classe=Texte, seuls les contenus qui correspondent aux *deux* critères seront ajoutés à votre réservoir de contenus.

source: Above the search fields is a button to Preview this search. Clicking the button after creating a search will open a new browser tab with the items which meet the criteria of the search.
fr: Au-dessus des champs de recherche se situe un bouton pour prévisualiser la recherche. Cliquer sur le bouton après avoir créé une recherche ouvrir un nouvel onglet navigateur avec les contenus qui correspondent aux critères de la recherche.

source: There is also a checkbox for "keep this search". Checking this box will re-load this search the next time you come to make changes to the site items.
fr: Il y a aussi une case à cocher pour « conserver cette recherche ». Cocher cette case rechargera cette recherche la prochaine fois que vous viendrez faire des modifications sur les contenus du site.

source: Search forms options are:
fr: Les options du formulaire de recherche sont:

source: *Search full-text:* search all values of all items.
fr: *Recherche plein texte:* rechercher dans toutes les valeurs de tous les contenus.

source: *Search by value:* search for a term or phrase which you enter
fr: *Recherche par valeur:* rechercher un terme ou une phrase que vous saisissez

source: The first selector allows you to specify a property to search.
fr: Le premier sélecteur vous permet de spécifier dans quelle propriété chercher.

source: The second selector allows you to set the relationship the property has with the value. The options are:
fr: Le deuxième sélecteur vous permet de définir la relation que la propriété a avec la valeur. Les options sont:

source: is exactly,
fr: est exactement,

source: is not exactly,
fr: n'est pas exactement,

source: contains,
fr: contient,

source: does not contain,
fr: ne contient pas,

source: is resource with ID,
fr: est la ressource avec ID,

source: is not resource with ID,
fr: n'est pas la ressource avec ID,

source: has any value (there is something in the property), and
fr: a une valeur quelconque (il y a quelque chose dans la propriété), et

source: has no values.
fr: n'a pas de valeurs.

source: Finally, there is a text field for you to enter the value you want the property to have.
fr: Enfin, un champ de texte vous permet de saisir la valeur que vous souhaitez attribuer à la propriété.

source: To find a resource ID, go to the resource and look at the url in your browser's address bar. The numbers at the end of the url are the resource ID.
fr: Pour trouver un identifiant de ressource, allez à la ressource et regardez l'URL dans la barre d'adresse de votre navigateur. Les chiffres à la fin de l'URL sont l'ID de la ressource.

source: *Search by Class:* select one or more classes from the dropdown menu - the search will only return items with this class.
fr: *Recherche par Classe:* sélectionnez une ou plusieurs classes à partir du menu déroulant - la recherche retournera uniquement des contenus avec cette classe.

source: *Search by template:* select from existing resource templates and the search will only return items using this resource template or templates.
fr: *Recherche par modèle:* sélectionnez parmi les modèles de ressource existants et la recherche retournera uniquement des contenus utilisant ce ou ces modèles.

source: *Search by item set:* select from a dropdown of item sets.
fr: *Recherche par collection:* sélectionnez parmi une liste déroulante de collection.

source: *Search by owner:* select from a dropdown of site users.
fr: *Recherche par propriétaire:* sélectionnez parmi une liste déroulante d'utilisateurs du site.

source: Note that the fields for searches by value, class, template, and item set have a large red plus sign to the left of the select options. Use these to add more than one search of this kind to your form. You can use the red trash can icon to the right of the field to remove it.
fr: Notez que les champs pour les recherches par valeur, classe, modèle, et collection ont un grand signe plus rouge à gauche des options de sélection. Utilisez les pour ajouter plus de recherche de ce type à votre formulaire. Vous pouvez utilisez l'icône de poubelle rouge à droite du champ pour le supprimer.

source: ![Select by class with two select fields loaded](../sites/sitesfiles/sites_resourcesSelectMulti.png)
fr: ![Sélectionner par classe avec deux champs de sélection chargés](../sites/sitesfiles/sites_resourcesSelectMulti.png)

source: Item Sets
fr: Collections

source: On this tab you can select which Item Sets will display on a Browse Item Sets page when added to the [navigation](../sites/site_navigation.md).
fr: Sur cet onglet vous pouvez sélectionner quelles collections seront affichées sur la page Parcourir les collections si elle est ajoutée à la [navigation](../sites/site_navigation.md).

source: The table in the Item Sets tab shows any item sets already added, with their title and owner's email address.
fr: Le tableau dans l'onglet Collections montre toutes les collections déjà ajoutées, avec leur titre et l'adresse e-mail de leur propriétaire.

source: ![Site resources Item Sets tab](../sites/sitesfiles/siteres_itemsets.png)
fr: ![Onglet Collections des ressources du site](../sites/sitesfiles/siteres_itemsets.png)

source: To add an item set, select it in the right hand sidebar. You can find the desired item set by either:
fr: Pour ajouter une collection, sélectionnez la dans la barre latérale droite. Vous pouvez trouvez la collection souhaitée en:

source: typing the name of the item set in the search bar and then clicking on the correct item set, or
fr: saisissant le nom de la collection dans la barre de recherche puis en cliquant sur la bonne collection, ou

source: click on the name of the item set owner, then clicking on the name of the item set.
fr: cliquant sur le nom du propriétaire de la collection, puis en cliquant sur le nom de la collection.

source: ![Selecting an item set from the owner's section of the sidebar](../sites/sitesfiles/siteres_itemsetsel.png)
fr: ![Sélectionner une collection à partir de la section du propriétaire dans la barre latérale](../sites/sitesfiles/siteres_itemsetsel.png)

source: Remove an item set by clicking the red delete button (trash can icon). It will still be available to re-add from the drawer on the right.
fr: Supprimez une collection en cliquant sur le bouton de suppression rouge (icône de poubelle). Elle sera toujours disponible dans le tiroir à droite.

source: You can change the order of the item sets by dragging and dropping using the three-bar icon on the left end of the row.
fr: Vous pouvez changer l'ordre des collections par glisser/déposer en utilisant l'icône des trois barres sur la gauche de la ligne.

source: The following image shows a browse item sets public view using the default theme:
fr: L'image suivante montre une vue publique de la page parcourir les collections qui utilise le thème par défaut:

source: ![browse item sets](../sites/sitesfiles/siteres_ispublic.png)
fr: ![parcourir les collections](../sites/sitesfiles/siteres_ispublic.png)
