Repository: omeka/omeka-s-enduser
Catalog: locales/*/LC_MESSAGES/docs/sites/site_navigation.po
Languages: fr

source: Use the *Navigation* tab of the [Sites](../sites/index.md) to manage the navigation, or menu, or your site. You can add links, browse pages, and your [pages](../sites/site_pages.md) to the navigation, arrange them, and delete links from the navigation.
fr: Utilisez l'onglet *Navigation* des [Sites](../sites/index.md) pour gérer la navigation, ou le menu, ou votre site. Vous pouvez ajouter des liens, parcourir les pages, ajouter vos [pages](../sites/site_pages.md) à la navigation, les organiser, et supprimer des liens de la navigation.

source: ![Editing navigation with a drawer on the right side of the screen for adding links](../sites/sitesfiles/sitenav_main.png)
fr: ![Modification de la navigation avec un tiroir sur le côté droit de l'écran pour ajouter des liens](../sites/sitesfiles/sitenav_main.png)

source: For every item in the navigation, you have three options: view (box with arrow icon); edit (pencil icon); or delete (trash can icon). Parent navigation pages also have a gray square with a black triangle which collapses or expands their child pages.
fr: Pour chaque élément dans la navigation, vous avez trois options: voir (icône de boîte avec une flèche) ; modifier (icône de crayon) ; ou supprimer (icône de poubelle). Les pages de navigation parente ont aussi un carré gris avec un triangle noir qui replie ou déplie leurs pages enfant.

source: ![Close up of two navigation sections. The top is "Quotes" which has a dark gray square on the end of it containing a black triangle pointing down. The bottom navigation section is called "Share a quote" and does not have the gray square](../sites/sitesfiles/sitenav_detail.png)
fr: ![Gros plan de deux sections de navigation. Celle du haut est « Quotes » qui a un carré gris à la fin qui contient un triangle noir pointant vers le bas. Celle du bas est appelée « Share a quote » et n'a pas de carré gris](../sites/sitesfiles/sitenav_detail.png)

source: Set Homepage
fr: Définir la page d'accueil

source: By default, the topmost page in the navigation acts the main page for your site. Note that custom URLs will not work as a home page - the topmost item in your navigation must be a page.
fr: Par défaut, la page au plus haut de la navigation est la page principale de votre site. Notez que les URLs personnalisées ne fonctionneront pas en page d'accueil - la page au plus haut de la navigation doit être une page.

source: You can set the homepage without changing the order of your pages using the *Select a homepage* section in the righthand drawer. This section has a dropdown which lists all the pages in your site. Simply select the page which you want to use as your homepage.
fr: Vous pouvez définir la page d'accueil sans modifier l'ordre de vos pages en utilisant la section *Sélectionnez une page d'accueil* dans le tiroir à droite. Cette section a une liste déroulante qui liste toutes les pages de votre site. Sélectionnez simplement la page que vous voulez utilisez comme page d'accueil.

source: ![Select a homepage dropdown open to show all the pages in this site](../sites/sitesfiles/sitenav_homeselect.png)
fr: ![Liste déroulante de sélection de page d'accueil qui montre toutes les pages du site](../sites/sitesfiles/sitenav_homeselect.png)

source: To change which page is used as the homepage, select a different page from the dropdown. If you want to revert to using the top page in the navigation, click the 'x' to the right of the page name in the menu (circled in red in the below image).
fr: Pour changer quelle page est utilisée comme page d'accueil, sélectionner une page différente dans la liste déroulante. Si vous voulez revenir à l'utilisation de la première page de la navigation, cliquez sur le « x » à droite du nom de la page dans le menu (entouré en rouge dans l'image ci-dessous).

source: ![Select a homepage set to Map page](../sites/sitesfiles/sitenav_homedel.png)
fr: ![Sélectionnez une page d'accueil défini à la page Map](../sites/sitesfiles/sitenav_homedel.png)

source: Adding Navigation
fr: Ajouter à la navigation

source: Add to the navigation of the site using the options on the right hand side of the page. There are two sections: [Add a custom link](#add-a-custom-link) and [Add a link to a site page](#site-page)
fr: Ajoutez à la navigation du site en utilisant les options sur le côté droit de la page. Il y a deux sections: [Ajouter un lien personnalisé](#add-a-custom-link) et [Ajouter un lien vers une page du site](#site-page)

source: Add a custom link
fr: Ajouter un lien personnalisé

source: To add a link you can use the *Add a custom link* options on the right hand drawer to add:
fr: Pour ajouter un lien vous pouvez utiliser les options *Ajouter un lien personnalisé* dans le tiroir à droite pour ajouter:

source: a *Custom URL* to any web address;
fr: une *URL personnalisée* vers n'importe quel adresse web;

source: a Browse page for items on your site;
fr: une page Parcourir pour les contenus de votre site;

source: a Browse page for item sets on your site.
fr: une page Parcourir pour les collections de votre site.

source: Or you can add one of your [pages](../sites/site_pages), which should be listed in the right-hand drawer below the *Add a custom link* dropdown. If you need to find a specific page, begin typing the page title in the search box with the helper text *Filter pages* which appears directly below the text “Add a link to a site page.”
fr: Ou vous pouvez ajouter une de vos [pages](../sites/site_pages), qui doivent être listées dans le tiroir à droite sous la liste déroulante *Ajouter un lien personnalisé*. Si vous avez besoin de trouver une page spécifique, commencez à saisir le titre de la page dans le champ de recherche avec le texte d'aide *Filtrer les pages* qui apparaît directement sous le texte « Ajouter un lien vers une page du site »

source: **Custom URL** link blocks display three pieces of information: the block *type* (Custom URL), the *label* which is the text which will appear in the site navigation menu, and the *url*.
fr: Les blocs de lien **URL personnalisée** affiche trois éléments d'informations: le *type* de block (URL personnalisée), le *libellé* qui est le texte qui apparaîtra dans le menu de navigation du site, et l'*URL*.

source: ![URL block with the label “RRCHNM” and url chnm.gmu.edu](../sites/sitesfiles/sitenav_url.png) URL Block
fr: ![Bloc URL avec le libellé « RRCHNM » et l'URL chnm.gmu.edu](../sites/sitesfiles/sitenav_url.png) Bloc URL

source: **Browse** blocks create a browse page for [resources](../sites/site_resources.md) already associated with your site. There are blocks to create a browse items page and a block to browse item sets.
fr: Les blocs **Parcourir** créent une page parcourir pour les [ressources](../sites/site_resources.md) déjà associées à votre site. Il y a des blocs pour créer une page de parcours des contenus et un bloc pour parcourir les collections.

source: You can change the *label* of the block to reflect what, specifically, site visitors will browse.
fr: Vous pouvez changer le *libellé* du bloc pour refléter spécifiquement ce que les visiteurs vont parcourir.

source: If you want to refine the Browse block, you can use the Query to create a search query that returns the desired results.
fr: Si vous voulez affiner le bloc Parcourir, vous pouvez utiliser la Requête pour créer une requête de recherche qui retournera les résultats désirés.

source: ![Browse block with the label ‘Browse’ and no query](../sites/sitesfiles/sitenav_browse.png)
fr: ![Bloc Parcourir avec le libellé « Parcourir » et aucune requête](../sites/sitesfiles/sitenav_browse.png)

source: Note that you **must** enter a query for the block to function.
fr: Notez que vous **devez** saisir une requête pour que le bloc fonctionne.

source: To create a Browse Item Set navigation for all the item sets which you have already assigned to the [resources](../sites/site_resources/) with the site on which you are working:
fr: Pour créer une navigation Parcourir les collections pour toutes les collections que vous avez déjà assigné aux [ressources](../sites/site_resources/) avec le site sur lequel vous êtes en train de travailler:

source: (In a separate window): conduct an [advanced item set search](../search.md#advanced-item-set-search) using your site for the "In site pool" option.
fr: (Dans une fenêtre séparée): effectuez une [recherche avancée de collections](../search.md#advanced-item-set-search) en utilisant votre site pour l'option « dans le réservoir du site ».

source: Once the search results load, highlight everything in your browser's address bar starting with the question mark all the way to the end of the search url (to the right).
fr: Une fois que les résultats de la recherche sont chargés, sélectionnez tout ce qui est dans la barre d'adresse de votre navigateur en commençant par le point d'interrogation jusqu'à la fin de l'URL de recherche (vers la droite).

source: ![Browser address bar with a query string highlighted](../sites/sitesfiles/sitenav_itemsetsearch.png)
fr: ![Barre d'adresse du navigateur avec la chaîne de requête sélectionnée](../sites/sitesfiles/sitenav_itemsetsearch.png)

source: Paste the text you just copied into the "Query" field of the Browse item sets Navigation link.
fr: Collez le texte que vous venez de copier dans le champ « Requête » du lien de navigation Parcourir les collections.

source: ![Browse item sets navigation item with a query pasted in to the Query field, and no alternate label supplied](../sites/sitesfiles/sitenav_browseitemset.png)
fr: ![Élément de navigation Parcourir les collections avec une requête collée dans le champ Requête, et aucun libellé alternatif fourni](../sites/sitesfiles/sitenav_browseitemset.png)

source: Site Page
fr: Page de site

source: Site page blocks create links to pages you have built for your site. The *page* field indicates which page is in use, as does the block title. You can change the *label* for the page link in the navigation, as in the example image below. Note that changing the label does not change the page title.
fr: Les blocs de page de site créent des liens vers les pages que vous avez construit pour votre site. Le champ *page* indique quelle page est utilisée, comme le fait le titre du bloc. Vous pouvez modifier le *libellé* pour le lien de page dans la navigation, comme dans l'image d'exemple ci-dessous. Notez que modifier le libellé ne change pas le titre de la page.

source: ![Page block with for the page Custard Page 2 labeled “More Custard”](../sites/sitesfiles/sitenav_pages.png) Site Page block
fr: ![Bloc de page pour la page Custard Page 2 libellée « More Custard »](../sites/sitesfiles/sitenav_pages.png) Bloc de page de site

source: If you have many pages, you can use the *Filter pages* field to find the names and slugs of specific pages.
fr: Si vous avez beaucoup de pages, vous pouvez utiliser le champ *Filtrer les pages* pour trouver les noms et identifiants de pages spécifiques.

source: Be sure to click Save before leaving the Navigation tab to save changes. If you do not want to save changes, click the Cancel button.
fr: Soyez sûr de cliquer sur Enregistrer avant de quitter l'onglet Navigation pour enregistrer les changements. Si vous ne voulez pas enregistrer les changements, cliquez sur le bouton Annuler.

source: Editing and Arranging Navigation
fr: Modifier et organiser la navigation

source: When you add a link block it is automatically expanded. To collapse an open link block, click the edit (pencil) icon in the upper right corner of each block, next to the delete (trash) icon. When you arrive at the Navigation tab after saving changes or from the main site edit page, the navigation items should be collapsed; open the block by clicking the edit (pencil) icon.
fr: Quand vous ajouter un bloc de lien il est automatiquement déplié. Pour replié un bloc de lien ouvert, cliquez sur l'icône de modification (crayon) dans le coin supérieur droit de chaque bloc, à côté de l'icône supprimer (poubelle). Quand vous arrivez sur l'onglet Navigation après avoir enregistrer les changements ou depuis la page principale de modification du site, les éléments de navigation doivent être repliés; ouvrez le bloc en cliquand sur l'icône de modification (crayon).

source: The topmost item in the navigation is the main page for your site.
fr: L'élément le plus haut dans la navigation est la page principale de votre site.

source: You can arrange your navigation links by dragging and dropping them into your preferred order. Nest links by dragging the desired child link on top of the desired parent link; when you do so a small black triangle should appear to the left of the parent block.
fr: Vous pouvez organiser les liens de navigation en les glissant et en les déposant dans l'ordre souhaité. Emboîtez les lien en glissant le lien enfant sur le lien parent; quand vous faites ça un petit triangle noir doit apparaître à gauche du bloc parent.

source: ![The block for Custard Page 2 - the child page - hovering over the block for Opening Page - the parent block.](../sites/sitesfiles/sitenav_drop.png) In this image, Custard page 2 is the child link; Opening Page will be the parent link, as indicated by the small black triangle on the left
fr: ![Le bloc pour « Custard Page 2 » - la page enfant - survolant le bloc pour « Opening Page » - le bloc parent.](../sites/sitesfiles/sitenav_drop.png) Dans cette image, « Custard page 2 » est le lien enfant; « Opening Page » sera le lien parent, comme indiqué par le petit triangle noir sur la gauche

source: Omeka S allows for multiple levels of nested navigation.
fr: Omeka S permet plusieurs niveaux d'indentation dans la navigation.

source: Deleting Navigation
fr: Supprimer la navigation

source: To delete a link from the navigation, click the delete (trash can) icon and then click *Save*. If you accidentally click the delete icon, you can click the undo (back looped arrow) icon before click save to cancel the deletion.
fr: Pour supprimer un lien de la navigation, cliquez sur l'icône supprimer (poubelle) et cliquez sur *Enregistrer*. Si vous cliquez de manière accidentelle sur l'icône supprimer, vous pouvez cliquer sur l'icône défaire (flèche en boucle arrière) avant de cliquer sur enregistrer pour annuler la suppression.

source: ![Two link blocks, one of which is highlighted in red and marked for deletion](../sites/sitesfiles/sitenav_del.png)
fr: ![Deux blocs de lien, dont un qui est surligné en rouge et marqué pour la suppression](../sites/sitesfiles/sitenav_del.png)

source: In this image, the delete icon for browse has been clicked; the block now displays the undo button instead
fr: Dans cette image, l'icône supprimer pour parcourir a été cliquée; le bloc affiche maintenant un bouton défaire à la place

source: NOTE: Deleting a parent block from the navigation will also delete any child blocks.
fr: NOTE: Supprimer un bloc parent de la navigation supprimera également tous les blocs enfant.

source: ![Parent and child block marked for deletion](../sites/sitesfiles/sitenav_del2.png)
fr: ![Les blocs parent et enfants sont marqués pour la suppression](../sites/sitesfiles/sitenav_del2.png)
