Repository: omeka/omeka-s-enduser
Catalog: locales/*/LC_MESSAGES/docs/content/item-sets.po
Languages: fr_fr

source: From the browse page of item sets (admin/item-set) you can batch edit item sets, using the dropdown menu on the upper right near the "Add new item set" button. You can select multiple item sets using the checkboxes on the left of each set's row.
fr_fr: À partir de la page de navigation des collections (admin / collections), vous pouvez éditer des collections par lot à l’aide du menu déroulant situé dans le coin supérieur droit de la page située sous le bouton "Ajouter une nouvelle collection". Vous pouvez sélectionner plusieurs collections à l'aide des cases à cocher situées à gauche de chaque ligne.

source: ![A red arrow points to the dropdown for batch editing and deleting options](contentfiles/itemsets_batch.png)
fr_fr: ![Une flèche rouge pointe vers la liste déroulante pour les options d'édition et de suppression par lots](/content/contentfiles/itemsets_batch.png)

source: Batch actions are as follows:
fr_fr: Les actions par lot sont les suivantes:

source: Edit selected: edit only the item sets that are selected on the page
fr_fr: Modifier sélectionnés: modifiez uniquement les collections sélectionnées sur la page.

source: Edit all: edit all the item sets returned by a search (default is all item sets)
fr_fr: Modifier tout: éditez toutes les collections renvoyées par une recherche (par défaut, toutes les collections)

source: Delete selected: delete only the item sets that are selected on the page
fr_fr: Supprimer sélectionnés: supprime uniquement les collections sélectionnées sur la page.

source: Delete all: delete all the item sets returned by a search (default is all item sets)
fr_fr: Supprimer tout: supprime toutes les collections renvoyées par une recherche (par défaut, toutes les collections)

source: Choose one of these options and then click *Go*.
fr_fr: Choisissez l'une de ces options, puis cliquez sur *Traiter*.

source: **Batch editing** item sets takes you to a new page. The item sets being edited will display on the right side in a drawer, while the batch edit form gives you the following options:
fr_fr: **L'édition par lot** des collections vous amène à une nouvelle page. Les collections en cours d'édition seront affichées à droite dans un onglet, tandis que le formulaire de modification par lot vous offre les options suivantes:

source: set visibility: a dropdown, select from public or not public.
fr_fr: visibilité de l'ensemble: une liste déroulante, sélectionnez *Public* ou *Non Public*.

source: set openness: a dropdown, select from open or not open.
fr_fr: définir l'ouverture: une liste déroulante, sélectionnez *Ouvert* ou *Non ouvert*.

source: set template: a dropdown, select from the installation's resource templates.
fr_fr: définir le modèle: une liste déroulante, sélectionnez parmi les modèles de ressources de l'instance.

source: set class: a dropdown, select from classes of the installed vocabularies.
fr_fr: définir une classe: une liste déroulante, sélectionnez parmi les classes de vocabulaires installés.

source: clear property values: a dropdown menu with all the properties in all vocabularies, selecting from this will remove any values in that property in the affected item sets. Clear additional properties using the *Clear another property* button.
fr_fr: effacer les valeurs d'une propriété: un menu déroulant contenant toutes les propriétés de tous les vocabulaires. En sélectionnant cette option, toutes les valeurs de cette propriété seront supprimées des collections concernées. Effacer les propriétés supplémentaires cliquant une nouvelle fois dans le champs.

source: ![Batch edit items form, with options as described above. Everything is grayscale](contentfiles/itemsets_batchedit.png)
fr_fr: ![L'édition en lot mène au formulaire avec les options décrites ci-dessus. Tout est en niveaux de gris](/content/contentfiles/itemsets_batchedit.png)

source: In addition, you can use the bottoms at the bottom of the batch edit form to add properties to every item set:
fr_fr: De plus, vous pouvez utiliser le bas du formulaire de modification par lot pour ajouter des propriétés à chaque ensemble d'éléments:

source: add text value
fr_fr: ajouter une valeur textuelle

source: add resource value
fr_fr: ajouter un lien vers une ressource

source: add URI value
fr_fr: ajouter une lien URI

source: Selecting any of these will add a block to the form where you can select a property from the installed vocabularies and enter the value for that property.
fr_fr: La sélection de ces éléments ajoutera un bloc au formulaire dans lequel vous pourrez sélectionner une propriété parmi les vocabulaires installés et entrer la valeur de cette propriété.

source: ![Image depicts only the Add text value block of the batch edit form, with a dropdown labeled "select property" above an empty text field](contentfiles/itemsets_property.png)
fr_fr: ![L'image représente uniquement le bloc Ajouter une valeur de texte du formulaire de modification par lot, avec une liste déroulante intitulée "Sélectionner la propriété " au-dessus d'un champ de texte vide.](/content/contentfiles/itemsets_property.png)

source: For the **delete actions**, a drawer will open on the right side of the screen telling you the number of item sets which will be deleted. Nothing will be deleted unless you click the red *Confirm Delete* button. This action cannot be undone. To opt out of deleting the item sets, click the X in the upper right corner of the deletion drawer. To confirm delete, check the "Are you sure" checkbox and then click *Confirm Delete*. Note that deleting the item set will not delete the items associated with that set.
fr_fr: Pour les **actions de suppression**, un onglet s'ouvre sur le côté droit de l'écran pour vous indiquer le nombre de collections à supprimer. Rien ne sera supprimé à moins que vous ne cliquiez sur le bouton rouge *Confirmer la suppression*. Cette action ne peut pas être annulée. Pour refuser de supprimer les collections, cliquez sur le X dans le coin supérieur droit de l'onglet de suppression. Pour confirmer la suppression, cochez la case "Êtes-vous sûr", puis cliquez sur *Confirmer la suppression*. Notez que la suppression d'une collection ne supprimera pas les contenus associés à cette collection.

source: ![Close up of the warning, with the text describing the number of items to be deleted in red.](contentfiles/itemsets_bulkdelete.png)
fr_fr: ![Gros plan sur l'avertissement, avec le texte décrivant le nombre d'éléments à supprimer en rouge.](/content/contentfiles/itemsets_bulkdelete.png)

source: Delete Item Set
fr_fr: Supprimer une collection

source: In addition to the batch delete function described above, you can also delete individual item sets.
fr_fr: Outre la fonction de suppression par lot décrite ci-dessus, vous pouvez également supprimer des collections individuellement.

source: Note that deleting item sets does not delete any items associated with the item set.
fr_fr: Notez que la suppression des collections ne supprime aucun contenu associé aux collections supprimées.

source: From the Item Set browse view, you can delete an item set by clicking the trash can icon in the row for the item set you want to delete. This will open a drawer on the right with a message at the top asking you to confirm that you want to delete the item set, with the metadata for the item set below the confirm delete button. Click *Confirm delete* to delete the item set, or close the drawer to cancel.
fr_fr: Dans l'écran Collections, vous pouvez supprimer une collection en cliquant sur l'icô ne corbeille sur la ligne correspondante à la collection que vous souhaitez supprimer. Cela ouvrira un onglet sur la droite avec un message en haut vous demandant de confirmer que vous souhaitez supprimer la collection avec les métadonnées pour la collection situées sous le bouton de confirmation de suppression. Cliquez sur *Confirmer la suppression* pour supprimer la collection ou fermez l'onglet pour annuler.

source: ![Browse item sets view with two item sets and a red arrow pointing to the trash can icon](contentfiles/itemsets_browseDel.png)
fr_fr: ![Vue des collections avec deux collections et une flèche rouge pointant sur l'icône de la corbeille](/content/contentfiles/itemsets_browseDel.png)

source: ![Drawer with a confirmation message to delete the an item set, including the Confirm delete button and the item set's basic descriptive metadata - title, description, and number of items in the set. ](contentfiles/itemsets_browseDel2.png)
fr_fr: ![Onglet avec un message de confirmation pour supprimer une collection et les métadonnées descriptives de base de la collection - titre, description et nombre d'éléments dans la collection. ](/content/contentfiles/itemsets_browseDel2.png)

source: From the edit page for an Item Set, click the *Delete* button in the upper right-hand corner. This will open a drawer on the right side asking you to confirm that you want to delete the item set. Click *Confirm delete* to delete the item set, or close the drawer to cancel.
fr_fr: Dans la page d'édition d'une collection, cliquez sur le bouton *Supprimer* dans le coin supérieur droit. Cela ouvrira un onglet sur le côté droit vous demandant de confirmer que vous souhaitez supprimer la collection. Cliquez sur *Confirmer la suppression* pour supprimer la collection ou fermez l'onglet pour annuler.

source: ![Close up of the warning drawer, with text stating "Are you sure you would like to delete this item set" and below it a red button with white text stating "Confirm delete".](contentfiles/itemset-delete2.png)
fr_fr: ![Gros plan sur l'onglet d'avertissement, avec le texte "Voulez-vous vraiment supprimer cette collection" et en dessous, un bouton rouge avec du texte blanc indiquant "Confirmer la suppression".](/content/contentfiles/itemset-delete2.png)
