Repository: omeka/omeka-s-enduser
Catalog: locales/*/LC_MESSAGES/docs/content/item-sets.po
Languages: fr_fr

source: Item Sets
fr_fr: Collections

source: Item sets are an aggregation of *items*, similar to collections in previous versions of Omeka. In Omeka S, items may belong to any number of sets, and an item set can have any number of items.
fr_fr: Les collections sont une agrégation de *contenus*, similaires aux collections des versions précédentes d'Omeka. Dans Omeka S, les contenus peuvent appartenir à un nombre illimité de collections, et une collection peut comporter un nombre illimité de contenus.

source: Item sets are managed via the *Item Sets* tab (stacked boxes) located in the left navigation of the admin dashboard.
fr_fr: Les collections sont gérées via l'onglet *Collections* (cases empilées) situé dans le panneau de navigation de gauche.

source: ![Browse item sets view with four item sets.](contentfiles/itemsets_browse.png)
fr_fr: ![Vue des collections avec quatre collections.](/content/contentfiles/itemsets_browse.png)

source: After clicking on the tab, a table appears listing all item sets with:
fr_fr: Après avoir cliqué sur l'onglet, un tableau apparaît répertoriant toutes les collections avec:

source: their *Title*;
fr_fr: leur *titre*;

source: icons for each row representing options to *edit* (pencil), *delete* (trash can), or *view details* (ellipses);
fr_fr: des icônes pour chaque ligne représentant des options pour *modifier* (crayon), *supprimer* (corbeille) ou *afficher les détails* (trois petits points);

source: the item set’s *Class*,
fr_fr: la *classe* de la collection,

source: the *Owner* of the set,
fr_fr: le *propriétaire* de la collection,

source: and the date the set was *Created*.
fr_fr: et quand la collection a été *créé*.

source: Above this table on the left is the pagination for the item sets table, where you can click the left and right arrows to move forward and back or enter a page number to go a specific page of item sets.
fr_fr: Au-dessus de ce tableau, à gauche, se trouve la pagination du tableau des collections, dans laquelle vous pouvez cliquer sur les flèches gauche et droite pour avancer ou reculer ou entrer un numéro de page pour accéder à une page spécifique de collections.

source: In the center above the table is the button for *advanced search*.
fr_fr: Au centre au-dessus du tableau se trouve le bouton pour la *recherche avancée*.

source: On the right above the table are drop-down menus to re-order the table by *title, class, owner,* or *date created* in either *ascending* or *descending* order.
fr_fr: À droite au-dessus du tableau, des menus déroulants vous permettent de réorganiser le tableau par *titre, classe, propriétaire,* ou *date créée* dans l'ordre *croissant* ou *décroissant*.

source: In the upper right corner is the button to *Add new item set*.
fr_fr: Dans le coin supérieur droit se trouve le bouton pour *Ajouter une nouvelle collection*.

source: View Item Set
fr_fr: Voir les collections

source: To quickly see information about an item set, click on the *view details* button (ellipses) for the item set on the item sets browse page. This will open a drawer on the right hand side of the page with the item set’s Title, Visibility, and number of Items.
fr_fr: Pour afficher rapidement des informations sur une collection, cliquez sur le bouton (trois petits points) pour afficher la collection sur la page de navigation. Cela ouvrira un onglet sur le côté droit de la page avec le titre, la visibilité et le nombre de contenus appartenant à la collection.

source: ![Drawer view of an item, with description and title](contentfiles/itemsets_drawer.png)
fr_fr: ![Vue de l'onglet d'une collection, avec description et titre](/content/contentfiles/itemsets_drawer.png)

source: To view all the information for an item set, click on its name. On the item sets view page, there are tabs to see an item set’s *Metadata* and *Linked Resources*. On the right side of the item set’s view page is information about the date created, owner, and visibility. For item sets, visibility includes both whether the set is private or public and whether other users can add items to the set.
fr_fr: Pour afficher toutes les informations d'une collection, cliquez sur son nom. Sur la page de la collection, des onglets permettent de voir les *métadonnées* et *ressources liées* d'une collection. Sur le côté droit de la page d’affichage, vous trouverez des informations sur la date de création, le propriétaire et la visibilité. Pour les collections la visibilité inclut à la fois si la collection est privée ou publique et si d'autres utilisateurs peuvent ajouter des contenus à la collection.

source: ![Reading view of a single item set](contentfiles/itemsets_view.png)
fr_fr: ![Vue du détail d'une collection](/content/contentfiles/itemsets_view.png)

source: The item set’s *metadata* is entered by users.
fr_fr: Les *métadonnées* d'une collection sont entrées par les utilisateurs.

source: *Linked resources* are items which have used the item set to populate specific metadata properties. When viewing linked resources, the table includes the predicate (property or description) and the object (linked item resource). Note that incoming resources (those used as properties for the item set being viewed) will *not* display here, as they already display in the item set's metadata.
fr_fr: *Les ressources liées* sont des contenus qui sont liés à la collection par des métadonnées spécifiques. Lors de l'affichage des ressources liées, la table inclut le propriétaire (propriété ou description) et l'objet. Notez que les ressources entrantes (celles utilisées comme propriétés pour la collection en cours de visualisation) ne seront pas affichées ici, car elles s'affichent déjà dans les métadonnées de la collection.

source: To view the items in a set, either click on the number of items in the set on the item set browse page, or click the *view items* button in the upper right corner of the individual item set page.
fr_fr: Pour afficher les contenus d'une collection, cliquez sur le nombre de contenus sur la page de navigation ou cliquez sur le bouton *Afficher les contenus* dans le coin supérieur droit de la page.

source: Add an item set
fr_fr: Ajouter une collection

source: To add a new item set, click the Item Sets tab from the left navigation of the dashboard. Click the *add new item set* button on the right hand side of the screen.
fr_fr: Pour ajouter une nouvelle collection, cliquez sur l'onglet Collection dans la barre de navigation de gauche du tableau de bord. Cliquez sur le bouton *ajouter une nouvelle collection* en haut à droite de l'écran.

source: Item sets may use the same resource templates available for items to provide pre-selected fields. Each set should contain at least one descriptive value, such as Dublin Core Description.
fr_fr: Les collections peuvent utiliser les mêmes modèles de ressources que les contenus afin de fournir des champs présélectionnés. Chaque collection doit contenir au moins une valeur descriptive, telle que Dublin Core Description.

source: You may add other fields by selecting a property from the list on the right. Browse fields by vocabulary (Dublin Core, Bibliographic Ontology, etc), or search in the *filter properties* bar above the list of properties and vocabularies.
fr_fr: Vous pouvez ajouter d'autres champs en sélectionnant une propriété dans la liste de droite. Parcourez les champs par vocabulaire (Dublin Core, ontologie bibliographique, etc.) ou recherchez-le dans la barre *filtrer les propriétés* au-dessus de la liste des propriétés et des vocabulaires.

source: Values tab
fr_fr: Onglet "Valeurs"

source: You may add text, a resource from the installation, or an external link in each field.
fr_fr: Vous pouvez ajouter du texte, une ressource Omeka ou un lien externe dans chaque champ.

source: ![Add item set, no properties selected](contentfiles/itemsets_add.png)
fr_fr: ![Ajout d'une collection, aucune propriété sélectionnée](/content/contentfiles/itemsets_add.png)

source: By default, a new Item Set will load with the properties dcterms:Title and dcterms:description. You may add other fields by selecting a property from the list on the right. Browse fields by vocabulary (Dublin Core, Bibliographic Ontology, etc), or search in the *filter properties* bar above the list of properties and vocabularies.
fr_fr: Par défaut, une nouvelle collection sera chargée avec les propriétés dcterms: Title et dcterms: description. Vous pouvez ajouter d'autres champs en sélectionnant une propriété dans la liste de droite. Parcourez les champs par vocabulaire (Dublin Core, ontologie bibliographique, etc.) ou recherchez-le dans la barre *filtrer les propriétés* au-dessus de la liste des propriétés et des vocabulaires.

source: You can set individual properties as Private or Publicly visible using the eye icon for each property. Note that properties set to private are still visible to Global Admins, Site Admins, and Editors will be able to see properties even when set to private. Authors will be able to see all properties on items they own, but will not see private properties created by other users.
fr_fr: Vous pouvez définir des propriétés individuelles comme privées ou publiquement visibles à l'aide de l'icône en forme d'œil pour chaque propriété. Notez que les propriété s définies comme privées sont toujours visibles par les administrateurs globaux, les administrateurs de site et les éditeurs pourront voir les propriétés même lorsqu'elles sont définies comme privées. Les auteurs pourront voir toutes les propriétés des objets qu’ils possèdent, mais ne verront pas les propriétés privées créées par d’autres utilisateurs.

source: In the image below, the first property (Title) is public as indicated by the open eye icon. The second property (Description) is private as indicated by the slashed-through eye icon. Clicking or hitting enter on the eye icon toggles between public and private.
fr_fr: Dans l'image ci-dessous, la première propriété (Titre) est publique, comme l'indique l'icône en forme d'œil ouvert. La deuxième propriété (Description) est privée, comme l'indique l'icône en forme de barre oblique. En cliquant ou en appuyant sur entrer sur l'icône de l'œil, vous basculez entre public et privé.

source: ![As described](contentfiles/item_propviz.png)
fr_fr: ![Comme décrit précedemment](/content/contentfiles/item_propviz.png)

source: Text
fr_fr: Texte

source: Text fields are entered with text. The keyboard at the top of the field input indicates text. You can indicate the language for the content of an input using the globe symbol above the input (see the red arrow in the image below). Click on the globe to activate a text field, then enter the [ISO 639-1](https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes) code for the language in which the text is written.
fr_fr: Les champs de texte sont réservés à du texte. Le clavier en haut du champ indique qu'il s'agit d'un champs "texte". Vous pouvez indiquer la langue du contenu d'une entré e à l'aide du symbole du globe situé au-dessus de l'entrée (voir la flèche rouge dans l'image ci-dessous). Cliquez sur le globe pour activer un champ de texte, puis entrez le [code ISO 639-1](https://en.wikipedia.org/wiki/List_of_ISO_639-1_codes) de la langue dans laquelle le texte est écrit.

source: Omeka Resource
fr_fr: Ressource Omeka

source: These fields create an internal link between the resource you are creating and the resource which fills that field. You have the option to use either another item or an item set. Once you select an item or item set, detailed information will load, and you must click *select resource* to finish linking the resources. You can also click the *X* button in the upper right-hand corner to go back to the list of items or item sets.
fr_fr: Ces champs créent un lien interne entre la ressource que vous créez et la ressource qui remplit ce champ. Vous avez la possibilité d'utiliser un autre contenu ou une collection. Une fois que vous avez sélectionné un contenu ou une collection, des informations détaillées seront chargées et vous devez cliquer sur *sélectionner une ressource* pour terminer la liaison des ressources. Vous pouvez également cliquer sur le bouton *X* dans le coin supérieur droit pour revenir à la liste des contenus ou collections.

source: When creating an item set, you have the option to use either another item or an item set.
fr_fr: Lors de la création d'une collection, vous avez la possibilité d'utiliser un autre contenu ou une autre collection.

source: Once you select an item or item set, detailed information will load, and you must click *select resource* to finish linking the resources. You can also click the *X* button in the upper right-hand corner to go back to the list of items or item sets.
fr_fr: Le choix d'un type de ressource ouvrira un onglet latéral dans lequel vous pourrez parcourir toutes les types de ressources de l'instance. Vous pouvez utiliser la fonction de recherche en haut de l'onglet pour réduire la liste ou pour trouver rapidement un contenu ou une collection.

source: ![Select Item menu with list of items to link in edit item view](contentfiles/items_addresource.png)
fr_fr: ![Menu Sélectionner un contenu avec une collection à lier](/content/contentfiles/items_addresource.png)

source: If you are using an Item resource for the property, you will have additional options for finding the item you want in the drawer. Open these options by clicking the triangle button next to the phrase "Filter search"
fr_fr: Si vous utilisez un contenu pour la propriété, vous aurez d'autres options pour rechercher l'élément souhaité dans l'onglet dédié. Ouvrez ces options en cliquant sur le triangle situé à côté de la phrase "Filtre de recherche".

source: ![Select Item drawer top options, with a red arrow around a gray triangle button to the right of the phrase "Filter search"](contentfiles/items_filtersearch.png)
fr_fr: ![Sélection des options supérieures de l'onglet, avec une flèche rouge autour d'un bouton triangle gris à droite de la phrase "Filtre de recherche".](/content/contentfiles/items_filtersearch.png)

source: This will open a menu below the button with the following options to filter the items in the drawer:
fr_fr: Cela ouvrira un menu sous le bouton avec les options suivantes pour filtrer les éléments dans le tiroir:

source: Filter by class: a dropdown where you can select any class provided by the vocabularies on the installation;
fr_fr: Filtrer par classe: une liste déroulante dans laquelle vous pouvez sélectionner n’ importe quelle classe fournie par les vocabulaires de l’instance;

source: Filter by item set: a dropdown where you can limit the items displayed in the drawer to only those associated with a particular item set
fr_fr: Filtrer par collection: une liste déroulante dans laquelle vous pouvez limiter les contenus affichés dans l'onglet à ceux associés à une collection particuliere.

source: Filter by item ID: a search field where you can input the ID of the item you want to use. You can find an item's ID in the url of it's edit page; if you are editing the item and the url is `admin/item/11547/edit` then the item's ID is 11547.
fr_fr: Filtrer par ID de contenu: un champ de recherche dans lequel vous pouvez saisir l'identifiant du contenu que vous souhaitez utiliser. Vous pouvez trouver l'ID d'un contenu dans l'url de sa page de modification; Si vous modifiez le contnu et que l'URL est `admin / item / 11547 / edit`, l'ID de l'élément est 11547.

source: ![options as above described](contentfiles/item_addresItem.png)
fr_fr: ![options décrites ci-dessus](/content/contentfiles/item_addresItem.png)

source: Item resources also have an option for "Quick add". When this switch is flipped, all of the items in the drawer have a checkbox. You can use these checkboxes to add multiple items as a property at once. Note that you can only edit one property at a time, so all of the items must populate the same property (ex, Creator, Has Part).
fr_fr: Les collections ont également une option pour "Ajout rapide". Lorsque cet interrupteur est activé, tous les contenus de l'onglet se retrouvent affichés avec une case à cocher. Vous pouvez utiliser ces cases à cocher pour ajouter plusieurs contenus à la fois en tant que propriété. Notez que vous ne pouvez modifier qu'une propriété à la fois, de sorte que tous les contenus doivent renseigner la même propriété (ex, Creator, Has Part).

source: ![a red arrow points to the slider button for "Quick add". The two items visible have an empty checkbox to the left of their representative thumbnail](contentfiles/items_quickadd.png)
fr_fr: ![une flèche rouge pointe sur le curseur pour "Ajout rapide". Les contenus visibles ont une case à cocher vide à gauche de la vignette](/content/contentfiles/items_quickadd.png)

source: URI fields link to an external website or online resource.
fr_fr: Les champs URI renvoient à un site Web externe ou à une ressource en ligne.

source: By default, Omeka S will use the media from the first item added to an item set to generate a thumbnail for the set. If you want to use a non-media image for the thumbnail for an item set you can set it here.
fr_fr: Par défaut, Omeka S utilisera le support du premier élément ajouté à une collection pour générer la vignette illustrant cette collection. Si vous souhaitez utiliser une autre image vous pouvez la définir ici.

source: ![Thumbnail tab with no asset selected. The tab displays a message about thumbnail creation and a button to "select" an asset](contentfiles/itemset_thumb1.png)
fr_fr: ![Onglet Vignette sans valeur sélectionnée. L'onglet affiche un message sur la création de vignettes et un bouton pour "sélectionner" une valeur.](/content/contentfiles/itemset_thumb1.png)

source: The assets you select from and upload as thumbnails in this tab are the same as those created for [site logos](../sites/site_theme.md#settings-options).
fr_fr: Les ressources que vous avez sélectionnées et téléchargées sous forme de vignettes dans cet onglet sont les mêmes que celles créées pour [les logos du site](../sites/site_theme/#settings-options).

source: To assign an asset as a thumbnail, click on the Select button in the main work area of the tab. This will open a drawer on the right side.
fr_fr: Pour attribuer une vignette, cliquez sur le bouton Sélectionner dans la zone de travail principale de l'onglet. Cela ouvrira un onglet sur le côté droit.

source: ![Select drawer with upload option and two assets, both of which are images.](contentfiles/itemset_thumb2.png)
fr_fr: ![Option de téléchargement.](/content/contentfiles/itemset_thumb2.png)

source: The drawer offers two options: upload a file using your browser, or select from existing assets. To select an existing asset, simply click on it and it will automatically be assigned to the item set.
fr_fr: L'onglet propose deux options: télécharger un fichier à l'aide de votre navigateur ou sélectionner des ressources existantes. Pour sélectionner une ressource existante, cliquez simplement dessus et elle sera automatiquement attribuée à la collection.

source: ![Add item set open to Thumbnail tab, where an asset which is an image of a quill pen on a scrolled piece of paper is in the main work area. Below it are buttons for Select and Clear](contentfiles/itemset_thumb3.png)
fr_fr: ![Ajout d'une collection ouvert. En dessous, des boutons pour sélectionner et effacer](/content/contentfiles/itemset_thumb3.png)

source: To remove an asset which you have assigned as a thumbnail, click the "Clear" button below the image of the asset. To replace it, click select and either choose or upload a new thumbnail asset.
fr_fr: Pour supprimer une vignette, cliquez sur le bouton "Effacer" situé sous l’image de la ressource. Pour la remplacer, cliquez sur Sélectionner et choisissez ou chargez une nouvelle vignette.

source: Access Settings
fr_fr: Paramètres d'accès

source: Item sets have two settings which control their access. They can be *public* or *not public* and they can be *open* or *closed*.
fr_fr: Les collections ont deux paramètres qde contrôle d'accès. Elles peuvent être *publiques* ou *privées* et elles peuvent être *ouvertes* ou *fermées*.

source: Use the *make public/private* button (eye icon) to make the item set visible to the public or only to all users of the Omeka S installation (not public).
fr_fr: Utilisez le bouton *Rendre public / privé* (icône en forme d’œil) pour rendre l’élément visible au public ou uniquement à tous les utilisateurs de l’installation Omeka S (privé).

source: *Open* sets can be edited and added to by any user on the install.
fr_fr: Les collections *ouvertes* peuvent être modifiées et complétées par n'importe quel utilisateur.

source: *Closed* sets are available and editable only by its creator, site admins, and global admins.
fr_fr: Les collections *fermées* sont disponibles et modifiables uniquement par son créateur, les administrateurs du site et les administrateurs globaux.

source: ![a set which is open and public, with an open padlock icon and an icon of an open eye](contentfiles/setOpenPublic.png) Open and Public
fr_fr: ![une collection ouverte et publique, avec une icône de cadenas ouvert et une icône représentant un œil ouvert](/content/contentfiles/setOpenPublic.png) Open and Public.

source: ![a set which is closed and private, with a closed padlock icon and an icon of an eye with a slash through it](contentfiles/setClosedPrivate.png) Closed and Private
fr_fr: ![une collection fermée et privée, avec une icône de cadenas fermé et une icône représentant un œil barré](/content/contentfiles/setClosedPrivate.png) Closed and Private

source: Note that the public/private and open/closed settings operate independently - you can have an open and private item set, for example.
fr_fr: Notez que les paramètres public / privé et ouvert / fermé fonctionnent indépendamment - vous pouvez définir un élément ouvert et privé, par exemple.

source: Edit an item set
fr_fr: Editer une collection

source: Once you have created an item set, you can edit it at any time, either by clicking the edit icon (pencil button) or clicking on the item set's title and then clicking the Edit button in the upper right-hand corner of the screen.
fr_fr: Une fois que vous avez créé une collection, vous pouvez la modifier à tout moment, en cliquant sur l'icône d'édition (bouton du crayon) ou en cliquant sur le titre de la collection, puis en cliquant sur le bouton Modifier dans le coin supérieur droit de l'écran.

source: Options for editing an item set are the same as for creating an item set.
fr_fr: Les options pour l'édition d'une collection sont les mêmes que pour la création d'une collection.

source: To cancel out of editing, click the Cancel button in the upper right corner, between the Delete and Save buttons.
fr_fr: Pour annuler les modifications, cliquez sur le bouton Annuler dans le coin supérieur droit, entre les boutons Supprimer et Enregistrer.

source: ![Detail view of the top row if information and buttons on an item edit view. A red arrow points to the Cancel button, on the far right](contentfiles/itemset_cancel.png)
fr_fr: ![Vue détaillée. Une flèche rouge pointe vers le bouton Annuler, à l'extrême droite](/content/contentfiles/itemset_cancel.png)

source: Batch Editing
fr_fr: Traitement en lot
